zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/MIMXRT2662_COMMON.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief The ASRC clock source
 */

typedef enum _asrc_clock_source
{
    kASRC_ClockSourceNotAvalible    = -1,          /**< not avalible */
    kASRC_ClockSourceBitClock0_AUD_PLL_DIV_CLK0 = 0U, /**< DSC clock output 0 */
    kASRC_ClockSourceBitClock1_AUD_PLL_DIV_CLK1 = 1U, /**< DSC clock output 1 */
    kASRC_ClockSourceBitClock2_AUD_CLK0 = 2U,      /**< Audio Clock Multiplexer 0 output */
    kASRC_ClockSourceBitClock3_AUD_CLK1 = 3U,      /**< Audio Clock Multiplexer 1 output */
    kASRC_ClockSourceBitClock4_eSAI0_RX_CLK = 4U,  /**< eSAI0 Receiver serial bit clock */
    kASRC_ClockSourceBitClock5_eSAI0_TX_CLK = 5U,  /**< eSAI0 Transmitter serial bit clock */
    kASRC_ClockSourceBitClock6_SPDIF0_RX = 6U,     /**< SPDIF0 Receiver serial bit clock */
    kASRC_ClockSourceBitClock7_SPDIF1_RX = 7U,     /**< SPDIF1 Receiver serial bit clock */
    kASRC_ClockSourceBitClock8_SAI0_RX_BCLK = 8U,  /**< SAI0 Receiver serial bit clock */
    kASRC_ClockSourceBitClock9_SAI0_TX_BCLK = 9U,  /**< SAI0 Transmitter serial bit clock */
    kASRC_ClockSourceBitClocka_SAI1_RX_BCLK = 10U, /**< SAI1 Receiver serial bit clock */
    kASRC_ClockSourceBitClockb_SAI1_TX_BCLK = 11U, /**< SAI1 Transmitter serial bit clock */
    kASRC_ClockSourceBitClockc_SAI2_RX_BCLK = 12U, /**< SAI2 Receiver serial bit clock */
    kASRC_ClockSourceBitClockd_SAI3_RX_BCLK = 13U, /**< SAI3 Receiver serial bit clock */
    kASRC_ClockSourceBitClocke_ASRC0_PRE_SEL = 14U, /**< ASRC0 pre-selector multiplexer */
    kASRC_ClockSourceMax            = 14U,         /**< max value */
} asrc_clock_source_t;

/*!
 * @addtogroup edma0_request
 * @{ */

/*******************************************************************************
 * Definitions
*******************************************************************************/

/*!
 * @brief Enumeration for the DMA0 hardware request
 *
 * Defines the enumeration for the DMA0 hardware request collections.
 */
typedef enum _main_edma5_request_source
{
    kDmaRequestMux0MainXSPI0Rx      = 1|0x100U,    /**< MAIN XSPI0 Rx Buffer Drain Request */
    kDmaRequestMux0MainXSPI0Tx      = 2|0x100U,    /**< MAIN XSPI0 Tx Buffer Fill Request */
    kDmaRequestMux0MainXSPI1Rx      = 3|0x100U,    /**< MAIN XSPI1 Rx Buffer Drain Request */
    kDmaRequestMux0MainXSPI1Tx      = 4|0x100U,    /**< MAIN XSPI1 Tx Buffer Fill Request */
    kDmaRequestMux0HspXBAR0OUT0     = 10|0x100U,   /**< HSP XBAR_OUT0 Request */
    kDmaRequestMux0HspXBAR0OUT1     = 11|0x100U,   /**< HSP XBAR_OUT1 Request */
    kDmaRequestMux0HspXBAR0OUT2     = 12|0x100U,   /**< HSP XBAR_OUT2 Request */
    kDmaRequestMux0HspXBAR0OUT3     = 13|0x100U,   /**< HSP XBAR_OUT3 Request */
    kDmaRequestMux0HspXBAR0OUT4     = 14|0x100U,   /**< HSP XBAR_OUT4 Request */
    kDmaRequestMux0HspXBAR0OUT5     = 15|0x100U,   /**< HSP XBAR_OUT5 Request */
    kDmaRequestMux0HspXBAR0OUT6     = 16|0x100U,   /**< HSP XBAR_OUT6 Request */
    kDmaRequestMux0HspXBAR0OUT7     = 17|0x100U,   /**< HSP XBAR_OUT7 Request */
    kDmaRequestMux0HspADC0Channel0  = 18|0x100U,   /**< HSP ADC0 Fifo 0 Request */
    kDmaRequestMux0HspADC0Channel1  = 19|0x100U,   /**< HSP ADC0 Fifo 1 Request */
    kDmaRequestMux0HspADC1Channel0  = 20|0x100U,   /**< HSP ADC1 Fifo 0 Request */
    kDmaRequestMux0HspADC1Channel1  = 21|0x100U,   /**< HSP ADC1 Fifo 1 Request */
    kDmaRequestMux0HspDAC           = 22|0x100U,   /**< HSP DAC Fifo Request */
    kDmaRequestMux0HspFlexIO0Request0Request8 = 23|0x100U, /**< HSP FlexIO0 Request 0 and Request 8 */
    kDmaRequestMux0HspFlexIO0Request1Request9 = 24|0x100U, /**< HSP FlexIO0 Request 1 and Request 9 */
    kDmaRequestMux0HspFlexIO0Request2Request10 = 25|0x100U, /**< HSP FlexIO0 Request 2 and Request 10 */
    kDmaRequestMux0HspFlexIO0Request3Request11 = 26|0x100U, /**< HSP FlexIO0 Request 3 and Request 11 */
    kDmaRequestMux0HspFlexIO0Request4Request12 = 27|0x100U, /**< HSP FlexIO0 Request 4 and Request 12 */
    kDmaRequestMux0HspFlexIO0Request5Request13 = 28|0x100U, /**< HSP FlexIO0 Request 5 and Request 13 */
    kDmaRequestMux0HspFlexIO0Request6Request14 = 29|0x100U, /**< HSP FlexIO0 Request 6 and Request 14 */
    kDmaRequestMux0HspFlexIO0Request7Request15 = 30|0x100U, /**< HSP FlexIO0 Request 7 and Request 15 */
    kDmaRequestMux0HspFlexIO1Request0Request8 = 31|0x100U, /**< HSP FlexIO0 Request 0 and Request 8 */
    kDmaRequestMux0HspFlexIO1Request1Request9 = 32|0x100U, /**< HSP FlexIO0 Request 1 and Request 9 */
    kDmaRequestMux0HspFlexIO1Request2Request10 = 33|0x100U, /**< HSP FlexIO0 Request 2 and Request 10 */
    kDmaRequestMux0HspFlexIO1Request3Request11 = 34|0x100U, /**< HSP FlexIO0 Request 3 and Request 11 */
    kDmaRequestMux0HspFlexIO1Request4Request12 = 35|0x100U, /**< HSP FlexIO0 Request 4 and Request 12 */
    kDmaRequestMux0HspFlexIO1Request5Request13 = 36|0x100U, /**< HSP FlexIO0 Request 5 and Request 13 */
    kDmaRequestMux0HspFlexIO1Request6Request14 = 37|0x100U, /**< HSP FlexIO0 Request 6 and Request 14 */
    kDmaRequestMux0HspFlexIO1Request7Request15 = 38|0x100U, /**< HSP FlexIO0 Request 7 and Request 15 */
    kDmaRequestMux0HspFlexIO2Request0Request8 = 39|0x100U, /**< HSP FlexIO0 Request 0 and Request 8 */
    kDmaRequestMux0HspFlexIO2Request1Request9 = 40|0x100U, /**< HSP FlexIO0 Request 1 and Request 9 */
    kDmaRequestMux0HspFlexIO2Request2Request10 = 41|0x100U, /**< HSP FlexIO0 Request 2 and Request 10 */
    kDmaRequestMux0HspFlexIO2Request3Request11 = 42|0x100U, /**< HSP FlexIO0 Request 3 and Request 11 */
    kDmaRequestMux0HspFlexIO2Request4Request12 = 43|0x100U, /**< HSP FlexIO0 Request 4 and Request 12 */
    kDmaRequestMux0HspFlexIO2Request5Request13 = 44|0x100U, /**< HSP FlexIO0 Request 5 and Request 13 */
    kDmaRequestMux0HspFlexIO2Request6Request14 = 45|0x100U, /**< HSP FlexIO0 Request 6 and Request 14 */
    kDmaRequestMux0HspFlexIO2Request7Request15 = 46|0x100U, /**< HSP FlexIO0 Request 7 and Request 15 */
    kDmaRequestMux0HspLPSPI0Tx      = 47|0x100U,   /**< HSP LPSPI0 Master/Slave Transmit */
    kDmaRequestMux0HspLPSPI0Rx      = 48|0x100U,   /**< HSP LPSPI0 Master/Slave Receive */
    kDmaRequestMux0HspLPSPI1Tx      = 49|0x100U,   /**< HSP LPSPI1 Master/Slave Transmit */
    kDmaRequestMux0HspLPSPI1Rx      = 50|0x100U,   /**< HSP LPSPI1 Master/Slave Receive */
    kDmaRequestMux0HspLPSPI2Tx      = 51|0x100U,   /**< HSP LPSPI2 Master/Slave Transmit */
    kDmaRequestMux0HspLPSPI2Rx      = 52|0x100U,   /**< HSP LPSPI2 Master/Slave Receive */
    kDmaRequestMux0HspLPSPI3Tx      = 53|0x100U,   /**< HSP LPSPI3 Master/Slave Transmit */
    kDmaRequestMux0HspLPSPI3Rx      = 54|0x100U,   /**< HSP LPSPI3 Master/Slave Receive */
    kDmaRequestMux0HspLPSPI4Tx      = 55|0x100U,   /**< HSP LPSPI4 Master/Slave Transmit */
    kDmaRequestMux0HspLPSPI4Rx      = 56|0x100U,   /**< HSP LPSPI4 Master/Slave Receive */
    kDmaRequestMux0HspRGPIO0Channel0 = 57|0x100U,  /**< HSP RGPIO0 Channel 0 */
    kDmaRequestMux0HspRGPIO0Channel1 = 58|0x100U,  /**< HSP RGPIO0 Channel 1 */
    kDmaRequestMux0HspRGPIO1Channel0 = 59|0x100U,  /**< HSP RGPIO1 Channel 0 */
    kDmaRequestMux0HspRGPIO1Channel1 = 60|0x100U,  /**< HSP RGPIO1 Channel 1 */
    kDmaRequestMux0HspRGPIO2Channel0 = 61|0x100U,  /**< HSP RGPIO2 Channel 0 */
    kDmaRequestMux0HspRGPIO2Channel1 = 62|0x100U,  /**< HSP RGPIO2 Channel 1 */
    kDmaRequestMux0HspRGPIO3Channel0 = 63|0x100U,  /**< HSP RGPIO3 Channel 0 */
    kDmaRequestMux0HspRGPIO3Channel1 = 64|0x100U,  /**< HSP RGPIO3 Channel 1 */
    kDmaRequestMux0HspRGPIO4Channel0 = 65|0x100U,  /**< HSP RGPIO4 Channel 0 */
    kDmaRequestMux0HspRGPIO4Channel1 = 66|0x100U,  /**< HSP RGPIO4 Channel 1 */
    kDmaRequestMux0CommENET0Channel0 = 73|0x100U,  /**< COMM ENET QOS Request 0 */
    kDmaRequestMux0CommENET0Channel1 = 74|0x100U,  /**< COMM ENET QOS Request 1 */
    kDmaRequestMux0CommENET1Channel0 = 75|0x100U,  /**< COMM ENET Request 0 */
    kDmaRequestMux0CommENET1Channel1 = 76|0x100U,  /**< COMM ENET Request 1 */
} main_edma5_request_source_t;

/* @} */

/*!
 * @addtogroup edma1_request
 * @{ */

