zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/MIMXRT2662_COMMON.h
    kHSP__XBAR_0_OutputHspLpspi4TrigIn = 190|0x20000U, /**< HSP_XBAR_0_OUT190 output assigned to HSP_LPSPI4_TRIG_IN */
    kHSP__XBAR_0_OutputHspLpuart0TrigIn = 191|0x20000U, /**< HSP_XBAR_0_OUT191 output assigned to HSP_LPUART0_TRIG_IN */
    kHSP__XBAR_0_OutputHspLpuart1TrigIn = 192|0x20000U, /**< HSP_XBAR_0_OUT192 output assigned to HSP_LPUART1_TRIG_IN */
    kHSP__XBAR_0_OutputHspLpuart2TrigIn = 193|0x20000U, /**< HSP_XBAR_0_OUT193 output assigned to HSP_LPUART2_TRIG_IN */
    kHSP__XBAR_0_OutputHspLpuart3TrigIn = 194|0x20000U, /**< HSP_XBAR_0_OUT194 output assigned to HSP_LPUART3_TRIG_IN */
    kHSP__XBAR_0_OutputHspLpuart4TrigIn = 195|0x20000U, /**< HSP_XBAR_0_OUT195 output assigned to HSP_LPUART4_TRIG_IN */
    kHSP__XBAR_0_OutputHspLpuart5TrigIn = 196|0x20000U, /**< HSP_XBAR_0_OUT196 output assigned to HSP_LPUART5_TRIG_IN */
    kHSP__XBAR_0_OutputRESERVED197  = 197|0x20000U, /**< HSP_XBAR_0_OUT197 output is reserved. */
    kHSP__XBAR_0_OutputRESERVED198  = 198|0x20000U, /**< HSP_XBAR_0_OUT198 output is reserved. */
    kHSP__XBAR_0_OutputCommFreqmeInput = 199|0x20000U, /**< HSP_XBAR_0_OUT199 output assigned to COMM_FREQME_INPUT */
    kHSP__XBAR_0_OutputCommEth0AuxTsTrigIn0 = 200|0x20000U, /**< HSP_XBAR_0_OUT200 output assigned to COMM_ETH0_AUX_TS_TRIG_IN0 */
    kHSP__XBAR_0_OutputCommEth0AuxTsTrigIn1 = 201|0x20000U, /**< HSP_XBAR_0_OUT201 output assigned to COMM_ETH0_AUX_TS_TRIG_IN1 */
    kHSP__XBAR_0_OutputCommEth0AuxTsTrigIn2 = 202|0x20000U, /**< HSP_XBAR_0_OUT202 output assigned to COMM_ETH0_AUX_TS_TRIG_IN2 */
    kHSP__XBAR_0_OutputCommEth0AuxTsTrigIn3 = 203|0x20000U, /**< HSP_XBAR_0_OUT203 output assigned to COMM_ETH0_AUX_TS_TRIG_IN3 */
    kHSP__XBAR_0_OutputCommEth0McgTrigIn0 = 204|0x20000U, /**< HSP_XBAR_0_OUT204 output assigned to COMM_ETH0_MCG_TRIG_IN0 */
    kHSP__XBAR_0_OutputCommEth0McgTrigIn1 = 205|0x20000U, /**< HSP_XBAR_0_OUT205 output assigned to COMM_ETH0_MCG_TRIG_IN1 */
    kHSP__XBAR_0_OutputCommEth0McgTrigIn2 = 206|0x20000U, /**< HSP_XBAR_0_OUT206 output assigned to COMM_ETH0_MCG_TRIG_IN2 */
    kHSP__XBAR_0_OutputCommEth0McgTrigIn3 = 207|0x20000U, /**< HSP_XBAR_0_OUT207 output assigned to COMM_ETH0_MCG_TRIG_IN3 */
    kHSP__XBAR_0_OutputCommEth1Ieee1588TimerIn0 = 208|0x20000U, /**< HSP_XBAR_0_OUT208 output assigned to COMM_ETH1_IEEE_1588_TIMER_IN0 */
    kHSP__XBAR_0_OutputCommEth1Ieee1588TimerIn1 = 209|0x20000U, /**< HSP_XBAR_0_OUT209 output assigned to COMM_ETH1_IEEE_1588_TIMER_IN1 */
    kHSP__XBAR_0_OutputCommEth1Ieee1588TimerIn2 = 210|0x20000U, /**< HSP_XBAR_0_OUT210 output assigned to COMM_ETH1_IEEE_1588_TIMER_IN2 */
    kHSP__XBAR_0_OutputCommEth1Ieee1588TimerIn3 = 211|0x20000U, /**< HSP_XBAR_0_OUT211 output assigned to COMM_ETH1_IEEE_1588_TIMER_IN3 */
    kHSP__XBAR_0_OutputRESERVED212  = 212|0x20000U, /**< HSP_XBAR_0_OUT212 output is reserved. */
    kHSP__XBAR_0_OutputCmptM85Rxev  = 213|0x20000U, /**< HSP_XBAR_0_OUT213 output assigned to CMPT_M85_RXEV */
    kHSP__XBAR_0_OutputRESERVED214  = 214|0x20000U, /**< HSP_XBAR_0_OUT214 output is reserved. */
    kHSP__XBAR_0_OutputRESERVED215  = 215|0x20000U, /**< HSP_XBAR_0_OUT215 output is reserved. */
    kHSP__XBAR_0_OutputCmptLlcPmTrigIn = 216|0x20000U, /**< HSP_XBAR_0_OUT216 output assigned to CMPT_LLC_PM_TRIG_IN */
    kHSP__XBAR_0_OutputCmptFreqmeInput = 217|0x20000U, /**< HSP_XBAR_0_OUT217 output assigned to CMPT_FREQME_INPUT */
    kHSP__XBAR_0_OutputMediaFreqmeInput = 218|0x20000U, /**< HSP_XBAR_0_OUT218 output assigned to MEDIA_FREQME_INPUT */
    kHSP__XBAR_0_OutputMediaDcif0DbiIn = 219|0x20000U, /**< HSP_XBAR_0_OUT219 output assigned to MEDIA_DCIF0_DBI_IN */
    kHSP__XBAR_0_OutputRESERVED220  = 220|0x20000U, /**< HSP_XBAR_0_OUT220 output is reserved. */
    kHSP__XBAR_0_OutputHspTrgsync0SyncIn0 = 221|0x20000U, /**< HSP_XBAR_0_OUT221 output assigned to HSP_TRGSYNC0_SYNC_IN0 */
    kHSP__XBAR_0_OutputHspTrgsync0SyncIn1 = 222|0x20000U, /**< HSP_XBAR_0_OUT222 output assigned to HSP_TRGSYNC0_SYNC_IN1 */
    kHSP__XBAR_0_OutputHspTrgsync0SyncIn2 = 223|0x20000U, /**< HSP_XBAR_0_OUT223 output assigned to HSP_TRGSYNC0_SYNC_IN2 */
    kHSP__XBAR_0_OutputHspTrgsync0SyncIn3 = 224|0x20000U, /**< HSP_XBAR_0_OUT224 output assigned to HSP_TRGSYNC0_SYNC_IN3 */
    kHSP__XBAR_0_OutputHspTrgsync0SyncIn4 = 225|0x20000U, /**< HSP_XBAR_0_OUT225 output assigned to HSP_TRGSYNC0_SYNC_IN4 */
    kHSP__XBAR_0_OutputHspTrgsync0SyncIn5 = 226|0x20000U, /**< HSP_XBAR_0_OUT226 output assigned to HSP_TRGSYNC0_SYNC_IN5 */
    kHSP__XBAR_0_OutputHspTrgsync0SyncIn6 = 227|0x20000U, /**< HSP_XBAR_0_OUT227 output assigned to HSP_TRGSYNC0_SYNC_IN6 */
    kHSP__XBAR_0_OutputHspTrgsync0SyncIn7 = 228|0x20000U, /**< HSP_XBAR_0_OUT228 output assigned to HSP_TRGSYNC0_SYNC_IN7 */
    kHSP__XBAR_0_OutputHspXbar0Out8 = 229|0x20000U, /**< HSP_XBAR_0_OUT229 output assigned to HSP_XBAR0_OUT8 */
    kHSP__XBAR_0_OutputHspXbar0Out9 = 230|0x20000U, /**< HSP_XBAR_0_OUT230 output assigned to HSP_XBAR0_OUT9 */
    kHSP__XBAR_0_OutputHspXbar0Out10 = 231|0x20000U, /**< HSP_XBAR_0_OUT231 output assigned to HSP_XBAR0_OUT10 */
    kHSP__XBAR_0_OutputHspXbar0Out11 = 232|0x20000U, /**< HSP_XBAR_0_OUT232 output assigned to HSP_XBAR0_OUT11 */
    kHSP__XBAR_0_OutputHspXbar0Out12 = 233|0x20000U, /**< HSP_XBAR_0_OUT233 output assigned to HSP_XBAR0_OUT12 */
    kHSP__XBAR_0_OutputHspXbar0Out13 = 234|0x20000U, /**< HSP_XBAR_0_OUT234 output assigned to HSP_XBAR0_OUT13 */
    kHSP__XBAR_0_OutputHspXbar0Out14 = 235|0x20000U, /**< HSP_XBAR_0_OUT235 output assigned to HSP_XBAR0_OUT14 */
    kHSP__XBAR_0_OutputHspXbar0Out15 = 236|0x20000U, /**< HSP_XBAR_0_OUT236 output assigned to HSP_XBAR0_OUT15 */
    kHSP__XBAR_0_OutputHspXbar0Out16 = 237|0x20000U, /**< HSP_XBAR_0_OUT237 output assigned to HSP_XBAR0_OUT16 */
    kHSP__XBAR_0_OutputHspXbar0Out17 = 238|0x20000U, /**< HSP_XBAR_0_OUT238 output assigned to HSP_XBAR0_OUT17 */
    kHSP__XBAR_0_OutputHspXbar0Out18 = 239|0x20000U, /**< HSP_XBAR_0_OUT239 output assigned to HSP_XBAR0_OUT18 */
    kHSP__XBAR_0_OutputHspXbar0Out19 = 240|0x20000U, /**< HSP_XBAR_0_OUT240 output assigned to HSP_XBAR0_OUT19 */
    kHSP__XBAR_0_OutputHspXbar0Out20 = 241|0x20000U, /**< HSP_XBAR_0_OUT241 output assigned to HSP_XBAR0_OUT20 */
    kHSP__XBAR_0_OutputHspXbar0Out21 = 242|0x20000U, /**< HSP_XBAR_0_OUT242 output assigned to HSP_XBAR0_OUT21 */
    kHSP__XBAR_0_OutputHspXbar0Out22 = 243|0x20000U, /**< HSP_XBAR_0_OUT243 output assigned to HSP_XBAR0_OUT22 */
    kHSP__XBAR_0_OutputHspXbar0Out23 = 244|0x20000U, /**< HSP_XBAR_0_OUT244 output assigned to HSP_XBAR0_OUT23 */
    kHSP__XBAR_0_OutputHspXbar0Out24 = 245|0x20000U, /**< HSP_XBAR_0_OUT245 output assigned to HSP_XBAR0_OUT24 */
    kHSP__XBAR_0_OutputHspXbar0Out25 = 246|0x20000U, /**< HSP_XBAR_0_OUT246 output assigned to HSP_XBAR0_OUT25 */
    kHSP__XBAR_0_OutputHspXbar0Out26 = 247|0x20000U, /**< HSP_XBAR_0_OUT247 output assigned to HSP_XBAR0_OUT26 */
    kHSP__XBAR_0_OutputHspXbar0Out27 = 248|0x20000U, /**< HSP_XBAR_0_OUT248 output assigned to HSP_XBAR0_OUT27 */
    kHSP__XBAR_0_OutputHspXbar0Out28 = 249|0x20000U, /**< HSP_XBAR_0_OUT249 output assigned to HSP_XBAR0_OUT28 */
    kHSP__XBAR_0_OutputHspXbar0Out29 = 250|0x20000U, /**< HSP_XBAR_0_OUT250 output assigned to HSP_XBAR0_OUT29 */
    kHSP__XBAR_0_OutputHspXbar0Out30 = 251|0x20000U, /**< HSP_XBAR_0_OUT251 output assigned to HSP_XBAR0_OUT30 */
    kHSP__XBAR_0_OutputHspXbar0Out31 = 252|0x20000U, /**< HSP_XBAR_0_OUT252 output assigned to HSP_XBAR0_OUT31 */
    kHSP__XBAR_0_OutputHspTrgsync1SyncIn0 = 253|0x20000U, /**< HSP_XBAR_0_OUT253 output assigned to HSP_TRGSYNC1_SYNC_IN0 */
    kHSP__XBAR_0_OutputHspTrgsync1SyncIn1 = 254|0x20000U, /**< HSP_XBAR_0_OUT254 output assigned to HSP_TRGSYNC1_SYNC_IN1 */
    kHSP__XBAR_0_OutputHspTrgsync1SyncIn2 = 255|0x20000U, /**< HSP_XBAR_0_OUT255 output assigned to HSP_TRGSYNC1_SYNC_IN2 */
    kHSP__XBAR_0_OutputHspTrgsync1SyncIn3 = 256|0x20000U, /**< HSP_XBAR_0_OUT256 output assigned to HSP_TRGSYNC1_SYNC_IN3 */
    kHSP__XBAR_0_OutputHspTrgsync1SyncIn4 = 257|0x20000U, /**< HSP_XBAR_0_OUT257 output assigned to HSP_TRGSYNC1_SYNC_IN4 */
    kHSP__XBAR_0_OutputHspTrgsync1SyncIn5 = 258|0x20000U, /**< HSP_XBAR_0_OUT258 output assigned to HSP_TRGSYNC1_SYNC_IN5 */
    kHSP__XBAR_0_OutputHspTrgsync1SyncIn6 = 259|0x20000U, /**< HSP_XBAR_0_OUT259 output assigned to HSP_TRGSYNC1_SYNC_IN6 */
    kHSP__XBAR_0_OutputHspTrgsync1SyncIn7 = 260|0x20000U, /**< HSP_XBAR_0_OUT260 output assigned to HSP_TRGSYNC1_SYNC_IN7 */
    kHSP__XBAR_1_OutputHspEvtg0Ina0 = 0|0x30000U,  /**< HSP_XBAR_1_OUT0 output assigned to HSP_EVTG0_INA0 */
    kHSP__XBAR_1_OutputHspEvtg0Inb0 = 1|0x30000U,  /**< HSP_XBAR_1_OUT1 output assigned to HSP_EVTG0_INB0 */
    kHSP__XBAR_1_OutputHspEvtg0Inc0 = 2|0x30000U,  /**< HSP_XBAR_1_OUT2 output assigned to HSP_EVTG0_INC0 */
    kHSP__XBAR_1_OutputHspEvtg0Ind0 = 3|0x30000U,  /**< HSP_XBAR_1_OUT3 output assigned to HSP_EVTG0_IND0 */
    kHSP__XBAR_1_OutputHspEvtg0Ina1 = 4|0x30000U,  /**< HSP_XBAR_1_OUT4 output assigned to HSP_EVTG0_INA1 */
    kHSP__XBAR_1_OutputHspEvtg0Inb1 = 5|0x30000U,  /**< HSP_XBAR_1_OUT5 output assigned to HSP_EVTG0_INB1 */
    kHSP__XBAR_1_OutputHspEvtg0Inc1 = 6|0x30000U,  /**< HSP_XBAR_1_OUT6 output assigned to HSP_EVTG0_INC1 */
    kHSP__XBAR_1_OutputHspEvtg0Ind1 = 7|0x30000U,  /**< HSP_XBAR_1_OUT7 output assigned to HSP_EVTG0_IND1 */
    kHSP__XBAR_1_OutputHspEvtg0Ina2 = 8|0x30000U,  /**< HSP_XBAR_1_OUT8 output assigned to HSP_EVTG0_INA2 */
    kHSP__XBAR_1_OutputHspEvtg0Inb2 = 9|0x30000U,  /**< HSP_XBAR_1_OUT9 output assigned to HSP_EVTG0_INB2 */
    kHSP__XBAR_1_OutputHspEvtg0Inc2 = 10|0x30000U, /**< HSP_XBAR_1_OUT10 output assigned to HSP_EVTG0_INC2 */
    kHSP__XBAR_1_OutputHspEvtg0Ind2 = 11|0x30000U, /**< HSP_XBAR_1_OUT11 output assigned to HSP_EVTG0_IND2 */
    kHSP__XBAR_1_OutputHspEvtg0Ina3 = 12|0x30000U, /**< HSP_XBAR_1_OUT12 output assigned to HSP_EVTG0_INA3 */
    kHSP__XBAR_1_OutputHspEvtg0Inb3 = 13|0x30000U, /**< HSP_XBAR_1_OUT13 output assigned to HSP_EVTG0_INB3 */
    kHSP__XBAR_1_OutputHspEvtg0Inc3 = 14|0x30000U, /**< HSP_XBAR_1_OUT14 output assigned to HSP_EVTG0_INC3 */
    kHSP__XBAR_1_OutputHspEvtg0Ind3 = 15|0x30000U, /**< HSP_XBAR_1_OUT15 output assigned to HSP_EVTG0_IND3 */
    kHSP__XBAR_1_OutputHspEvtg1Ina0 = 16|0x30000U, /**< HSP_XBAR_1_OUT16 output assigned to HSP_EVTG1_INA0 */
    kHSP__XBAR_1_OutputHspEvtg1Inb0 = 17|0x30000U, /**< HSP_XBAR_1_OUT17 output assigned to HSP_EVTG1_INB0 */
    kHSP__XBAR_1_OutputHspEvtg1Inc0 = 18|0x30000U, /**< HSP_XBAR_1_OUT18 output assigned to HSP_EVTG1_INC0 */
    kHSP__XBAR_1_OutputHspEvtg1Ind0 = 19|0x30000U, /**< HSP_XBAR_1_OUT19 output assigned to HSP_EVTG1_IND0 */
    kHSP__XBAR_1_OutputHspEvtg1Ina1 = 20|0x30000U, /**< HSP_XBAR_1_OUT20 output assigned to HSP_EVTG1_INA1 */
    kHSP__XBAR_1_OutputHspEvtg1Inb1 = 21|0x30000U, /**< HSP_XBAR_1_OUT21 output assigned to HSP_EVTG1_INB1 */
    kHSP__XBAR_1_OutputHspEvtg1Inc1 = 22|0x30000U, /**< HSP_XBAR_1_OUT22 output assigned to HSP_EVTG1_INC1 */
    kHSP__XBAR_1_OutputHspEvtg1Ind1 = 23|0x30000U, /**< HSP_XBAR_1_OUT23 output assigned to HSP_EVTG1_IND1 */
    kHSP__XBAR_1_OutputHspEvtg1Ina2 = 24|0x30000U, /**< HSP_XBAR_1_OUT24 output assigned to HSP_EVTG1_INA2 */
    kHSP__XBAR_1_OutputHspEvtg1Inb2 = 25|0x30000U, /**< HSP_XBAR_1_OUT25 output assigned to HSP_EVTG1_INB2 */
    kHSP__XBAR_1_OutputHspEvtg1Inc2 = 26|0x30000U, /**< HSP_XBAR_1_OUT26 output assigned to HSP_EVTG1_INC2 */
    kHSP__XBAR_1_OutputHspEvtg1Ind2 = 27|0x30000U, /**< HSP_XBAR_1_OUT27 output assigned to HSP_EVTG1_IND2 */
    kHSP__XBAR_1_OutputHspEvtg1Ina3 = 28|0x30000U, /**< HSP_XBAR_1_OUT28 output assigned to HSP_EVTG1_INA3 */
    kHSP__XBAR_1_OutputHspEvtg1Inb3 = 29|0x30000U, /**< HSP_XBAR_1_OUT29 output assigned to HSP_EVTG1_INB3 */
    kHSP__XBAR_1_OutputHspEvtg1Inc3 = 30|0x30000U, /**< HSP_XBAR_1_OUT30 output assigned to HSP_EVTG1_INC3 */
    kHSP__XBAR_1_OutputHspEvtg1Ind3 = 31|0x30000U, /**< HSP_XBAR_1_OUT31 output assigned to HSP_EVTG1_IND3 */
    kHSP__XBAR_1_OutputHspEvtg2Ina0 = 32|0x30000U, /**< HSP_XBAR_1_OUT32 output assigned to HSP_EVTG2_INA0 */
    kHSP__XBAR_1_OutputHspEvtg2Inb0 = 33|0x30000U, /**< HSP_XBAR_1_OUT33 output assigned to HSP_EVTG2_INB0 */
    kHSP__XBAR_1_OutputHspEvtg2Inc0 = 34|0x30000U, /**< HSP_XBAR_1_OUT34 output assigned to HSP_EVTG2_INC0 */
    kHSP__XBAR_1_OutputHspEvtg2Ind0 = 35|0x30000U, /**< HSP_XBAR_1_OUT35 output assigned to HSP_EVTG2_IND0 */
    kHSP__XBAR_1_OutputHspEvtg2Ina1 = 36|0x30000U, /**< HSP_XBAR_1_OUT36 output assigned to HSP_EVTG2_INA1 */
    kHSP__XBAR_1_OutputHspEvtg2Inb1 = 37|0x30000U, /**< HSP_XBAR_1_OUT37 output assigned to HSP_EVTG2_INB1 */
    kHSP__XBAR_1_OutputHspEvtg2Inc1 = 38|0x30000U, /**< HSP_XBAR_1_OUT38 output assigned to HSP_EVTG2_INC1 */
    kHSP__XBAR_1_OutputHspEvtg2Ind1 = 39|0x30000U, /**< HSP_XBAR_1_OUT39 output assigned to HSP_EVTG2_IND1 */
    kHSP__XBAR_1_OutputHspEvtg2Ina2 = 40|0x30000U, /**< HSP_XBAR_1_OUT40 output assigned to HSP_EVTG2_INA2 */
    kHSP__XBAR_1_OutputHspEvtg2Inb2 = 41|0x30000U, /**< HSP_XBAR_1_OUT41 output assigned to HSP_EVTG2_INB2 */
    kHSP__XBAR_1_OutputHspEvtg2Inc2 = 42|0x30000U, /**< HSP_XBAR_1_OUT42 output assigned to HSP_EVTG2_INC2 */
    kHSP__XBAR_1_OutputHspEvtg2Ind2 = 43|0x30000U, /**< HSP_XBAR_1_OUT43 output assigned to HSP_EVTG2_IND2 */
    kHSP__XBAR_1_OutputHspEvtg2Ina3 = 44|0x30000U, /**< HSP_XBAR_1_OUT44 output assigned to HSP_EVTG2_INA3 */
    kHSP__XBAR_1_OutputHspEvtg2Inb3 = 45|0x30000U, /**< HSP_XBAR_1_OUT45 output assigned to HSP_EVTG2_INB3 */
    kHSP__XBAR_1_OutputHspEvtg2Inc3 = 46|0x30000U, /**< HSP_XBAR_1_OUT46 output assigned to HSP_EVTG2_INC3 */
    kHSP__XBAR_1_OutputHspEvtg2Ind3 = 47|0x30000U, /**< HSP_XBAR_1_OUT47 output assigned to HSP_EVTG2_IND3 */
    kHSP__XBAR_1_OutputHspEvtg3Ina0 = 48|0x30000U, /**< HSP_XBAR_1_OUT48 output assigned to HSP_EVTG3_INA0 */
    kHSP__XBAR_1_OutputHspEvtg3Inb0 = 49|0x30000U, /**< HSP_XBAR_1_OUT49 output assigned to HSP_EVTG3_INB0 */
    kHSP__XBAR_1_OutputHspEvtg3Inc0 = 50|0x30000U, /**< HSP_XBAR_1_OUT50 output assigned to HSP_EVTG3_INC0 */
    kHSP__XBAR_1_OutputHspEvtg3Ind0 = 51|0x30000U, /**< HSP_XBAR_1_OUT51 output assigned to HSP_EVTG3_IND0 */
    kHSP__XBAR_1_OutputHspEvtg3Ina1 = 52|0x30000U, /**< HSP_XBAR_1_OUT52 output assigned to HSP_EVTG3_INA1 */
    kHSP__XBAR_1_OutputHspEvtg3Inb1 = 53|0x30000U, /**< HSP_XBAR_1_OUT53 output assigned to HSP_EVTG3_INB1 */
    kHSP__XBAR_1_OutputHspEvtg3Inc1 = 54|0x30000U, /**< HSP_XBAR_1_OUT54 output assigned to HSP_EVTG3_INC1 */
    kHSP__XBAR_1_OutputHspEvtg3Ind1 = 55|0x30000U, /**< HSP_XBAR_1_OUT55 output assigned to HSP_EVTG3_IND1 */
    kHSP__XBAR_1_OutputHspEvtg3Ina2 = 56|0x30000U, /**< HSP_XBAR_1_OUT56 output assigned to HSP_EVTG3_INA2 */
    kHSP__XBAR_1_OutputHspEvtg3Inb2 = 57|0x30000U, /**< HSP_XBAR_1_OUT57 output assigned to HSP_EVTG3_INB2 */
    kHSP__XBAR_1_OutputHspEvtg3Inc2 = 58|0x30000U, /**< HSP_XBAR_1_OUT58 output assigned to HSP_EVTG3_INC2 */
    kHSP__XBAR_1_OutputHspEvtg3Ind2 = 59|0x30000U, /**< HSP_XBAR_1_OUT59 output assigned to HSP_EVTG3_IND2 */
    kHSP__XBAR_1_OutputHspEvtg3Ina3 = 60|0x30000U, /**< HSP_XBAR_1_OUT60 output assigned to HSP_EVTG3_INA3 */
    kHSP__XBAR_1_OutputHspEvtg3Inb3 = 61|0x30000U, /**< HSP_XBAR_1_OUT61 output assigned to HSP_EVTG3_INB3 */
    kHSP__XBAR_1_OutputHspEvtg3Inc3 = 62|0x30000U, /**< HSP_XBAR_1_OUT62 output assigned to HSP_EVTG3_INC3 */
    kHSP__XBAR_1_OutputHspEvtg3Ind3 = 63|0x30000U, /**< HSP_XBAR_1_OUT63 output assigned to HSP_EVTG3_IND3 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In2 = 0|0x40000U, /**< HSP_XBAR_2_OUT0 output assigned to HSP_XBAR0_XBAR1_IN2 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In3 = 1|0x40000U, /**< HSP_XBAR_2_OUT1 output assigned to HSP_XBAR0_XBAR1_IN3 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In4 = 2|0x40000U, /**< HSP_XBAR_2_OUT2 output assigned to HSP_XBAR0_XBAR1_IN4 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In5 = 3|0x40000U, /**< HSP_XBAR_2_OUT3 output assigned to HSP_XBAR0_XBAR1_IN5 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In6 = 4|0x40000U, /**< HSP_XBAR_2_OUT4 output assigned to HSP_XBAR0_XBAR1_IN6 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In7 = 5|0x40000U, /**< HSP_XBAR_2_OUT5 output assigned to HSP_XBAR0_XBAR1_IN7 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In8 = 6|0x40000U, /**< HSP_XBAR_2_OUT6 output assigned to HSP_XBAR0_XBAR1_IN8 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In9 = 7|0x40000U, /**< HSP_XBAR_2_OUT7 output assigned to HSP_XBAR0_XBAR1_IN9 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In10 = 8|0x40000U, /**< HSP_XBAR_2_OUT8 output assigned to HSP_XBAR0_XBAR1_IN10 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In11 = 9|0x40000U, /**< HSP_XBAR_2_OUT9 output assigned to HSP_XBAR0_XBAR1_IN11 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In12 = 10|0x40000U, /**< HSP_XBAR_2_OUT10 output assigned to HSP_XBAR0_XBAR1_IN12 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In13 = 11|0x40000U, /**< HSP_XBAR_2_OUT11 output assigned to HSP_XBAR0_XBAR1_IN13 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In14 = 12|0x40000U, /**< HSP_XBAR_2_OUT12 output assigned to HSP_XBAR0_XBAR1_IN14 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In15 = 13|0x40000U, /**< HSP_XBAR_2_OUT13 output assigned to HSP_XBAR0_XBAR1_IN15 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In16 = 14|0x40000U, /**< HSP_XBAR_2_OUT14 output assigned to HSP_XBAR0_XBAR1_IN16 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In17 = 15|0x40000U, /**< HSP_XBAR_2_OUT15 output assigned to HSP_XBAR0_XBAR1_IN17 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In18 = 16|0x40000U, /**< HSP_XBAR_2_OUT16 output assigned to HSP_XBAR0_XBAR1_IN18 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In19 = 17|0x40000U, /**< HSP_XBAR_2_OUT17 output assigned to HSP_XBAR0_XBAR1_IN19 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In20 = 18|0x40000U, /**< HSP_XBAR_2_OUT18 output assigned to HSP_XBAR0_XBAR1_IN20 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In21 = 19|0x40000U, /**< HSP_XBAR_2_OUT19 output assigned to HSP_XBAR0_XBAR1_IN21 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In22 = 20|0x40000U, /**< HSP_XBAR_2_OUT20 output assigned to HSP_XBAR0_XBAR1_IN22 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In23 = 21|0x40000U, /**< HSP_XBAR_2_OUT21 output assigned to HSP_XBAR0_XBAR1_IN23 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In24 = 22|0x40000U, /**< HSP_XBAR_2_OUT22 output assigned to HSP_XBAR0_XBAR1_IN24 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In25 = 23|0x40000U, /**< HSP_XBAR_2_OUT23 output assigned to HSP_XBAR0_XBAR1_IN25 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In26 = 24|0x40000U, /**< HSP_XBAR_2_OUT24 output assigned to HSP_XBAR0_XBAR1_IN26 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In27 = 25|0x40000U, /**< HSP_XBAR_2_OUT25 output assigned to HSP_XBAR0_XBAR1_IN27 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In28 = 26|0x40000U, /**< HSP_XBAR_2_OUT26 output assigned to HSP_XBAR0_XBAR1_IN28 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In29 = 27|0x40000U, /**< HSP_XBAR_2_OUT27 output assigned to HSP_XBAR0_XBAR1_IN29 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In30 = 28|0x40000U, /**< HSP_XBAR_2_OUT28 output assigned to HSP_XBAR0_XBAR1_IN30 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In31 = 29|0x40000U, /**< HSP_XBAR_2_OUT29 output assigned to HSP_XBAR0_XBAR1_IN31 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In32 = 30|0x40000U, /**< HSP_XBAR_2_OUT30 output assigned to HSP_XBAR0_XBAR1_IN32 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In33 = 31|0x40000U, /**< HSP_XBAR_2_OUT31 output assigned to HSP_XBAR0_XBAR1_IN33 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In34 = 32|0x40000U, /**< HSP_XBAR_2_OUT32 output assigned to HSP_XBAR0_XBAR1_IN34 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In35 = 33|0x40000U, /**< HSP_XBAR_2_OUT33 output assigned to HSP_XBAR0_XBAR1_IN35 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In36 = 34|0x40000U, /**< HSP_XBAR_2_OUT34 output assigned to HSP_XBAR0_XBAR1_IN36 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In37 = 35|0x40000U, /**< HSP_XBAR_2_OUT35 output assigned to HSP_XBAR0_XBAR1_IN37 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In38 = 36|0x40000U, /**< HSP_XBAR_2_OUT36 output assigned to HSP_XBAR0_XBAR1_IN38 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In39 = 37|0x40000U, /**< HSP_XBAR_2_OUT37 output assigned to HSP_XBAR0_XBAR1_IN39 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In40 = 38|0x40000U, /**< HSP_XBAR_2_OUT38 output assigned to HSP_XBAR0_XBAR1_IN40 */
    kHSP__XBAR_2_OutputHspXbar0Xbar1In41 = 39|0x40000U, /**< HSP_XBAR_2_OUT39 output assigned to HSP_XBAR0_XBAR1_IN41 */
    kWAKE__XBAR_OutputWakeXbarOut0  = 0|0x50000U,  /**< WAKE_XBAR_OUT0 output assigned to WAKE_XBAR_OUT0 */
    kWAKE__XBAR_OutputWakeXbarOut1  = 1|0x50000U,  /**< WAKE_XBAR_OUT1 output assigned to WAKE_XBAR_OUT1 */
    kWAKE__XBAR_OutputWakeAcmp0Sample = 2|0x50000U, /**< WAKE_XBAR_OUT2 output assigned to WAKE_ACMP0_SAMPLE */
    kWAKE__XBAR_OutputWakeAcmp1Sample = 3|0x50000U, /**< WAKE_XBAR_OUT3 output assigned to WAKE_ACMP1_SAMPLE */
    kWAKE__XBAR_OutputWakeAcmp2Sample = 4|0x50000U, /**< WAKE_XBAR_OUT4 output assigned to WAKE_ACMP2_SAMPLE */
    kWAKE__XBAR_OutputWakeAcmp3Sample = 5|0x50000U, /**< WAKE_XBAR_OUT5 output assigned to WAKE_ACMP3_SAMPLE */
    kWAKE__XBAR_OutputWakeAcmp0123RrTrig = 6|0x50000U, /**< WAKE_XBAR_OUT6 output assigned to WAKE_ACMP0123_RR_TRIG */
    kWAKE__XBAR_OutputWakeEwmIn     = 7|0x50000U,  /**< WAKE_XBAR_OUT7 output assigned to WAKE_EWM_IN */
    kWAKE__XBAR_OutputWakeFreqmeInput = 8|0x50000U, /**< WAKE_XBAR_OUT8 output assigned to WAKE_FREQME_INPUT */
    kWAKE__XBAR_OutputWakeQuadtpmTrigIn0 = 9|0x50000U, /**< WAKE_XBAR_OUT9 output assigned to WAKE_QUADTPM_TRIG_IN0 */
    kWAKE__XBAR_OutputWakeQuadtpmTrigIn1 = 10|0x50000U, /**< WAKE_XBAR_OUT10 output assigned to WAKE_QUADTPM_TRIG_IN1 */
    kWAKE__XBAR_OutputWakeQuadtpmTrigIn2 = 11|0x50000U, /**< WAKE_XBAR_OUT11 output assigned to WAKE_QUADTPM_TRIG_IN2 */
    kWAKE__XBAR_OutputWakeQuadtpmTrigIn3 = 12|0x50000U, /**< WAKE_XBAR_OUT12 output assigned to WAKE_QUADTPM_TRIG_IN3 */
    kWAKE__XBAR_OutputWakeLpi2c0TrigIn = 13|0x50000U, /**< WAKE_XBAR_OUT13 output assigned to WAKE_LPI2C0_TRIG_IN */
    kWAKE__XBAR_OutputWakeLpi2c1TrigIn = 14|0x50000U, /**< WAKE_XBAR_OUT14 output assigned to WAKE_LPI2C1_TRIG_IN */
    kWAKE__XBAR_OutputWakeLpspiTrigIn = 15|0x50000U, /**< WAKE_XBAR_OUT15 output assigned to WAKE_LPSPI_TRIG_IN */
    kWAKE__XBAR_OutputWakeLpuart0TrigIn = 16|0x50000U, /**< WAKE_XBAR_OUT16 output assigned to WAKE_LPUART0_TRIG_IN */
    kWAKE__XBAR_OutputWakeLpuart1TrigIn = 17|0x50000U, /**< WAKE_XBAR_OUT17 output assigned to WAKE_LPUART1_TRIG_IN */
    kWAKE__XBAR_OutputRESERVED18    = 18|0x50000U, /**< WAKE_XBAR_OUT18 output is reserved. */
    kWAKE__XBAR_OutputRESERVED19    = 19|0x50000U, /**< WAKE_XBAR_OUT19 output is reserved. */
    kWAKE__XBAR_OutputRESERVED20    = 20|0x50000U, /**< WAKE_XBAR_OUT20 output is reserved. */
    kWAKE__XBAR_OutputHspXbar0In78Xbar1In46 = 21|0x50000U, /**< WAKE_XBAR_OUT21 output assigned to HSP_XBAR0_IN78_XBAR1_IN46 */
    kWAKE__XBAR_OutputHspXbar0In79Xbar1In47 = 22|0x50000U, /**< WAKE_XBAR_OUT22 output assigned to HSP_XBAR0_IN79_XBAR1_IN47 */
    kWAKE__XBAR_OutputHspXbar0In80Xbar1In48 = 23|0x50000U, /**< WAKE_XBAR_OUT23 output assigned to HSP_XBAR0_IN80_XBAR1_IN48 */
    kWAKE__XBAR_OutputHspXbar0In81Xbar1In49 = 24|0x50000U, /**< WAKE_XBAR_OUT24 output assigned to HSP_XBAR0_IN81_XBAR1_IN49 */
    kWAKE__XBAR_OutputHspXbar0In82Xbar1In50 = 25|0x50000U, /**< WAKE_XBAR_OUT25 output assigned to HSP_XBAR0_IN82_XBAR1_IN50 */
    kWAKE__XBAR_OutputHspXbar0In83Xbar1In51 = 26|0x50000U, /**< WAKE_XBAR_OUT26 output assigned to HSP_XBAR0_IN83_XBAR1_IN51 */
    kWAKE__XBAR_OutputHspXbar0In84Xbar1In52 = 27|0x50000U, /**< WAKE_XBAR_OUT27 output assigned to HSP_XBAR0_IN84_XBAR1_IN52 */
    kWAKE__XBAR_OutputHspXbar0In85Xbar1In53 = 28|0x50000U, /**< WAKE_XBAR_OUT28 output assigned to HSP_XBAR0_IN85_XBAR1_IN53 */
    kWAKE__XBAR_OutputWakeXbarOut29 = 29|0x50000U, /**< WAKE_XBAR_OUT29 output assigned to WAKE_XBAR_OUT29 */
    kWAKE__XBAR_OutputWakeXbarOut30 = 30|0x50000U, /**< WAKE_XBAR_OUT30 output assigned to WAKE_XBAR_OUT30 */
