zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/MIMXRT2662_COMMON.h
    kWAKE__XBAR_OutputWakeTrgsyncSyncIn0 = 31|0x50000U, /**< WAKE_XBAR_OUT31 output assigned to WAKE_TRGSYNC_SYNC_IN0 */
    kWAKE__XBAR_OutputWakeTrgsyncSyncIn1 = 32|0x50000U, /**< WAKE_XBAR_OUT32 output assigned to WAKE_TRGSYNC_SYNC_IN1 */
    kWAKE__XBAR_OutputWakeTrgsyncSyncIn2 = 33|0x50000U, /**< WAKE_XBAR_OUT33 output assigned to WAKE_TRGSYNC_SYNC_IN2 */
    kWAKE__XBAR_OutputWakeTrgsyncSyncIn3 = 34|0x50000U, /**< WAKE_XBAR_OUT34 output assigned to WAKE_TRGSYNC_SYNC_IN3 */
} xbar_output_signal_t;


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ADC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__ADC_0 base address */
  #define HSP__ADC_0_BASE                          (0x52050000u)
  /** Peripheral HSP__ADC_0 base address */
  #define HSP__ADC_0_BASE_NS                       (0x42050000u)
  /** Peripheral HSP__ADC_0 base pointer */
  #define HSP__ADC_0                               ((ADC_Type *)HSP__ADC_0_BASE)
  /** Peripheral HSP__ADC_0 base pointer */
  #define HSP__ADC_0_NS                            ((ADC_Type *)HSP__ADC_0_BASE_NS)
  /** Peripheral HSP__ADC_1 base address */
  #define HSP__ADC_1_BASE                          (0x52850000u)
  /** Peripheral HSP__ADC_1 base address */
  #define HSP__ADC_1_BASE_NS                       (0x42850000u)
  /** Peripheral HSP__ADC_1 base pointer */
  #define HSP__ADC_1                               ((ADC_Type *)HSP__ADC_1_BASE)
  /** Peripheral HSP__ADC_1 base pointer */
  #define HSP__ADC_1_NS                            ((ADC_Type *)HSP__ADC_1_BASE_NS)
  /** Array initializer of ADC peripheral base addresses */
  #define ADC_BASE_ADDRS                           { HSP__ADC_0_BASE, HSP__ADC_1_BASE }
  /** Array initializer of ADC peripheral base pointers */
  #define ADC_BASE_PTRS                            { HSP__ADC_0, HSP__ADC_1 }
  /** Array initializer of ADC peripheral base addresses */
  #define ADC_BASE_ADDRS_NS                        { HSP__ADC_0_BASE_NS, HSP__ADC_1_BASE_NS }
  /** Array initializer of ADC peripheral base pointers */
  #define ADC_BASE_PTRS_NS                         { HSP__ADC_0_NS, HSP__ADC_1_NS }
#else
  /** Peripheral HSP__ADC_0 base address */
  #define HSP__ADC_0_BASE                          (0x42050000u)
  /** Peripheral HSP__ADC_0 base pointer */
  #define HSP__ADC_0                               ((ADC_Type *)HSP__ADC_0_BASE)
  /** Peripheral HSP__ADC_1 base address */
  #define HSP__ADC_1_BASE                          (0x42850000u)
  /** Peripheral HSP__ADC_1 base pointer */
  #define HSP__ADC_1                               ((ADC_Type *)HSP__ADC_1_BASE)
  /** Array initializer of ADC peripheral base addresses */
  #define ADC_BASE_ADDRS                           { HSP__ADC_0_BASE, HSP__ADC_1_BASE }
  /** Array initializer of ADC peripheral base pointers */
  #define ADC_BASE_PTRS                            { HSP__ADC_0, HSP__ADC_1 }
#endif
/** Interrupt vectors for the ADC peripheral type */
#define ADC_IRQS                                 { HSP_ADC0_IRQn, HSP_ADC1_IRQn }

/* AHB_SRAMC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MAIN__AHB_SRAMC base address */
  #define MAIN__AHB_SRAMC_BASE                     (0x50080000u)
  /** Peripheral MAIN__AHB_SRAMC base address */
  #define MAIN__AHB_SRAMC_BASE_NS                  (0x40080000u)
  /** Peripheral MAIN__AHB_SRAMC base pointer */
  #define MAIN__AHB_SRAMC                          ((AHB_SRAMC_Type *)MAIN__AHB_SRAMC_BASE)
  /** Peripheral MAIN__AHB_SRAMC base pointer */
  #define MAIN__AHB_SRAMC_NS                       ((AHB_SRAMC_Type *)MAIN__AHB_SRAMC_BASE_NS)
  /** Array initializer of AHB_SRAMC peripheral base addresses */
  #define AHB_SRAMC_BASE_ADDRS                     { MAIN__AHB_SRAMC_BASE }
  /** Array initializer of AHB_SRAMC peripheral base pointers */
  #define AHB_SRAMC_BASE_PTRS                      { MAIN__AHB_SRAMC }
  /** Array initializer of AHB_SRAMC peripheral base addresses */
  #define AHB_SRAMC_BASE_ADDRS_NS                  { MAIN__AHB_SRAMC_BASE_NS }
  /** Array initializer of AHB_SRAMC peripheral base pointers */
  #define AHB_SRAMC_BASE_PTRS_NS                   { MAIN__AHB_SRAMC_NS }
#else
  /** Peripheral MAIN__AHB_SRAMC base address */
  #define MAIN__AHB_SRAMC_BASE                     (0x40080000u)
  /** Peripheral MAIN__AHB_SRAMC base pointer */
  #define MAIN__AHB_SRAMC                          ((AHB_SRAMC_Type *)MAIN__AHB_SRAMC_BASE)
  /** Array initializer of AHB_SRAMC peripheral base addresses */
  #define AHB_SRAMC_BASE_ADDRS                     { MAIN__AHB_SRAMC_BASE }
  /** Array initializer of AHB_SRAMC peripheral base pointers */
  #define AHB_SRAMC_BASE_PTRS                      { MAIN__AHB_SRAMC }
#endif

/* ASRC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AUDIO__ASRC base address */
  #define AUDIO__ASRC_BASE                         (0x58140000u)
  /** Peripheral AUDIO__ASRC base address */
  #define AUDIO__ASRC_BASE_NS                      (0x48140000u)
  /** Peripheral AUDIO__ASRC base pointer */
  #define AUDIO__ASRC                              ((ASRC_Type *)AUDIO__ASRC_BASE)
  /** Peripheral AUDIO__ASRC base pointer */
  #define AUDIO__ASRC_NS                           ((ASRC_Type *)AUDIO__ASRC_BASE_NS)
  /** Array initializer of ASRC peripheral base addresses */
  #define ASRC_BASE_ADDRS                          { AUDIO__ASRC_BASE }
  /** Array initializer of ASRC peripheral base pointers */
  #define ASRC_BASE_PTRS                           { AUDIO__ASRC }
  /** Array initializer of ASRC peripheral base addresses */
  #define ASRC_BASE_ADDRS_NS                       { AUDIO__ASRC_BASE_NS }
  /** Array initializer of ASRC peripheral base pointers */
  #define ASRC_BASE_PTRS_NS                        { AUDIO__ASRC_NS }
#else
  /** Peripheral AUDIO__ASRC base address */
  #define AUDIO__ASRC_BASE                         (0x48140000u)
  /** Peripheral AUDIO__ASRC base pointer */
  #define AUDIO__ASRC                              ((ASRC_Type *)AUDIO__ASRC_BASE)
  /** Array initializer of ASRC peripheral base addresses */
  #define ASRC_BASE_ADDRS                          { AUDIO__ASRC_BASE }
  /** Array initializer of ASRC peripheral base pointers */
  #define ASRC_BASE_PTRS                           { AUDIO__ASRC }
#endif
/** Interrupt vectors for the ASRC peripheral type */
#define ASRC_IRQS                                { AUDIO_ASRC_IRQn }

/* AUDIO_XCVR - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AUDIO__SPDIF base address */
  #define AUDIO__SPDIF_BASE                        (0x58600000u)
  /** Peripheral AUDIO__SPDIF base address */
  #define AUDIO__SPDIF_BASE_NS                     (0x48600000u)
  /** Peripheral AUDIO__SPDIF base pointer */
  #define AUDIO__SPDIF                             ((AUDIO_XCVR_Type *)AUDIO__SPDIF_BASE)
  /** Peripheral AUDIO__SPDIF base pointer */
  #define AUDIO__SPDIF_NS                          ((AUDIO_XCVR_Type *)AUDIO__SPDIF_BASE_NS)
  /** Array initializer of AUDIO_XCVR peripheral base addresses */
  #define AUDIO_XCVR_BASE_ADDRS                    { AUDIO__SPDIF_BASE }
  /** Array initializer of AUDIO_XCVR peripheral base pointers */
  #define AUDIO_XCVR_BASE_PTRS                     { AUDIO__SPDIF }
  /** Array initializer of AUDIO_XCVR peripheral base addresses */
  #define AUDIO_XCVR_BASE_ADDRS_NS                 { AUDIO__SPDIF_BASE_NS }
  /** Array initializer of AUDIO_XCVR peripheral base pointers */
  #define AUDIO_XCVR_BASE_PTRS_NS                  { AUDIO__SPDIF_NS }
#else
  /** Peripheral AUDIO__SPDIF base address */
  #define AUDIO__SPDIF_BASE                        (0x48600000u)
  /** Peripheral AUDIO__SPDIF base pointer */
  #define AUDIO__SPDIF                             ((AUDIO_XCVR_Type *)AUDIO__SPDIF_BASE)
  /** Array initializer of AUDIO_XCVR peripheral base addresses */
  #define AUDIO_XCVR_BASE_ADDRS                    { AUDIO__SPDIF_BASE }
  /** Array initializer of AUDIO_XCVR peripheral base pointers */
  #define AUDIO_XCVR_BASE_PTRS                     { AUDIO__SPDIF }
#endif
/** Interrupt vectors for the AUDIO_XCVR peripheral type */
#define AUDIO_XCVR_IRQS                          { AUDIO_SPDIF_IRQn }

/* AXBS - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MAIN__AXBS base address */
  #define MAIN__AXBS_BASE                          (0x50090000u)
  /** Peripheral MAIN__AXBS base address */
  #define MAIN__AXBS_BASE_NS                       (0x40090000u)
  /** Peripheral MAIN__AXBS base pointer */
  #define MAIN__AXBS                               ((AXBS_Type *)MAIN__AXBS_BASE)
  /** Peripheral MAIN__AXBS base pointer */
  #define MAIN__AXBS_NS                            ((AXBS_Type *)MAIN__AXBS_BASE_NS)
  /** Array initializer of AXBS peripheral base addresses */
  #define AXBS_BASE_ADDRS                          { MAIN__AXBS_BASE }
  /** Array initializer of AXBS peripheral base pointers */
  #define AXBS_BASE_PTRS                           { MAIN__AXBS }
  /** Array initializer of AXBS peripheral base addresses */
  #define AXBS_BASE_ADDRS_NS                       { MAIN__AXBS_BASE_NS }
  /** Array initializer of AXBS peripheral base pointers */
  #define AXBS_BASE_PTRS_NS                        { MAIN__AXBS_NS }
#else
  /** Peripheral MAIN__AXBS base address */
  #define MAIN__AXBS_BASE                          (0x40090000u)
  /** Peripheral MAIN__AXBS base pointer */
  #define MAIN__AXBS                               ((AXBS_Type *)MAIN__AXBS_BASE)
  /** Array initializer of AXBS peripheral base addresses */
  #define AXBS_BASE_ADDRS                          { MAIN__AXBS_BASE }
  /** Array initializer of AXBS peripheral base pointers */
  #define AXBS_BASE_PTRS                           { MAIN__AXBS }
#endif

/* CAN - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__FLEXCAN_0 base address */
  #define HSP__FLEXCAN_0_BASE                      (0x520F0000u)
  /** Peripheral HSP__FLEXCAN_0 base address */
  #define HSP__FLEXCAN_0_BASE_NS                   (0x420F0000u)
  /** Peripheral HSP__FLEXCAN_0 base pointer */
  #define HSP__FLEXCAN_0                           ((CAN_Type *)HSP__FLEXCAN_0_BASE)
  /** Peripheral HSP__FLEXCAN_0 base pointer */
  #define HSP__FLEXCAN_0_NS                        ((CAN_Type *)HSP__FLEXCAN_0_BASE_NS)
  /** Peripheral HSP__FLEXCAN_1 base address */
  #define HSP__FLEXCAN_1_BASE                      (0x52100000u)
  /** Peripheral HSP__FLEXCAN_1 base address */
  #define HSP__FLEXCAN_1_BASE_NS                   (0x42100000u)
  /** Peripheral HSP__FLEXCAN_1 base pointer */
  #define HSP__FLEXCAN_1                           ((CAN_Type *)HSP__FLEXCAN_1_BASE)
  /** Peripheral HSP__FLEXCAN_1 base pointer */
  #define HSP__FLEXCAN_1_NS                        ((CAN_Type *)HSP__FLEXCAN_1_BASE_NS)
  /** Peripheral HSP__FLEXCAN_2 base address */
  #define HSP__FLEXCAN_2_BASE                      (0x528F0000u)
  /** Peripheral HSP__FLEXCAN_2 base address */
  #define HSP__FLEXCAN_2_BASE_NS                   (0x428F0000u)
  /** Peripheral HSP__FLEXCAN_2 base pointer */
  #define HSP__FLEXCAN_2                           ((CAN_Type *)HSP__FLEXCAN_2_BASE)
  /** Peripheral HSP__FLEXCAN_2 base pointer */
  #define HSP__FLEXCAN_2_NS                        ((CAN_Type *)HSP__FLEXCAN_2_BASE_NS)
  /** Array initializer of CAN peripheral base addresses */
  #define CAN_BASE_ADDRS                           { HSP__FLEXCAN_0_BASE, HSP__FLEXCAN_1_BASE, HSP__FLEXCAN_2_BASE }
  /** Array initializer of CAN peripheral base pointers */
  #define CAN_BASE_PTRS                            { HSP__FLEXCAN_0, HSP__FLEXCAN_1, HSP__FLEXCAN_2 }
  /** Array initializer of CAN peripheral base addresses */
  #define CAN_BASE_ADDRS_NS                        { HSP__FLEXCAN_0_BASE_NS, HSP__FLEXCAN_1_BASE_NS, HSP__FLEXCAN_2_BASE_NS }
  /** Array initializer of CAN peripheral base pointers */
  #define CAN_BASE_PTRS_NS                         { HSP__FLEXCAN_0_NS, HSP__FLEXCAN_1_NS, HSP__FLEXCAN_2_NS }
#else
  /** Peripheral HSP__FLEXCAN_0 base address */
  #define HSP__FLEXCAN_0_BASE                      (0x420F0000u)
  /** Peripheral HSP__FLEXCAN_0 base pointer */
  #define HSP__FLEXCAN_0                           ((CAN_Type *)HSP__FLEXCAN_0_BASE)
  /** Peripheral HSP__FLEXCAN_1 base address */
  #define HSP__FLEXCAN_1_BASE                      (0x42100000u)
  /** Peripheral HSP__FLEXCAN_1 base pointer */
  #define HSP__FLEXCAN_1                           ((CAN_Type *)HSP__FLEXCAN_1_BASE)
  /** Peripheral HSP__FLEXCAN_2 base address */
  #define HSP__FLEXCAN_2_BASE                      (0x428F0000u)
  /** Peripheral HSP__FLEXCAN_2 base pointer */
  #define HSP__FLEXCAN_2                           ((CAN_Type *)HSP__FLEXCAN_2_BASE)
  /** Array initializer of CAN peripheral base addresses */
  #define CAN_BASE_ADDRS                           { HSP__FLEXCAN_0_BASE, HSP__FLEXCAN_1_BASE, HSP__FLEXCAN_2_BASE }
  /** Array initializer of CAN peripheral base pointers */
  #define CAN_BASE_PTRS                            { HSP__FLEXCAN_0, HSP__FLEXCAN_1, HSP__FLEXCAN_2 }
#endif
/** Interrupt vectors for the CAN peripheral type */
#define CAN_Rx_Warning_IRQS                      { HSP_FLEXCAN0_IRQn, HSP_FLEXCAN1_IRQn, HSP_FLEXCAN2_IRQn }
#define CAN_Tx_Warning_IRQS                      { HSP_FLEXCAN0_IRQn, HSP_FLEXCAN1_IRQn, HSP_FLEXCAN2_IRQn }
#define CAN_Wake_Up_IRQS                         { HSP_FLEXCAN0_IRQn, HSP_FLEXCAN1_IRQn, HSP_FLEXCAN2_IRQn }
#define CAN_Error_IRQS                           { HSP_FLEXCAN0_IRQn, HSP_FLEXCAN1_IRQn, HSP_FLEXCAN2_IRQn }
#define CAN_Bus_Off_IRQS                         { HSP_FLEXCAN0_IRQn, HSP_FLEXCAN1_IRQn, HSP_FLEXCAN2_IRQn }
#define CAN_ORed_Message_buffer_IRQS             { HSP_FLEXCAN0_IRQn, HSP_FLEXCAN1_IRQn, HSP_FLEXCAN2_IRQn }

/* CCM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AUDIO__CCM base address */
  #define AUDIO__CCM_BASE                          (0x58060000u)
  /** Peripheral AUDIO__CCM base address */
  #define AUDIO__CCM_BASE_NS                       (0x48060000u)
  /** Peripheral AUDIO__CCM base pointer */
  #define AUDIO__CCM                               ((CCM_Type *)AUDIO__CCM_BASE)
  /** Peripheral AUDIO__CCM base pointer */
  #define AUDIO__CCM_NS                            ((CCM_Type *)AUDIO__CCM_BASE_NS)
  /** Peripheral CMPT__CCM base address */
  #define CMPT__CCM_BASE                           (0x54060000u)
  /** Peripheral CMPT__CCM base address */
  #define CMPT__CCM_BASE_NS                        (0x44060000u)
  /** Peripheral CMPT__CCM base pointer */
  #define CMPT__CCM                                ((CCM_Type *)CMPT__CCM_BASE)
  /** Peripheral CMPT__CCM base pointer */
  #define CMPT__CCM_NS                             ((CCM_Type *)CMPT__CCM_BASE_NS)
  /** Peripheral COMM__CCM base address */
  #define COMM__CCM_BASE                           (0x5A060000u)
  /** Peripheral COMM__CCM base address */
  #define COMM__CCM_BASE_NS                        (0x4A060000u)
  /** Peripheral COMM__CCM base pointer */
  #define COMM__CCM                                ((CCM_Type *)COMM__CCM_BASE)
  /** Peripheral COMM__CCM base pointer */
  #define COMM__CCM_NS                             ((CCM_Type *)COMM__CCM_BASE_NS)
  /** Peripheral MAIN__CCM base address */
  #define MAIN__CCM_BASE                           (0x50060000u)
  /** Peripheral MAIN__CCM base address */
  #define MAIN__CCM_BASE_NS                        (0x40060000u)
  /** Peripheral MAIN__CCM base pointer */
  #define MAIN__CCM                                ((CCM_Type *)MAIN__CCM_BASE)
  /** Peripheral MAIN__CCM base pointer */
  #define MAIN__CCM_NS                             ((CCM_Type *)MAIN__CCM_BASE_NS)
  /** Peripheral MEDIA__CCM base address */
  #define MEDIA__CCM_BASE                          (0x5C060000u)
  /** Peripheral MEDIA__CCM base address */
  #define MEDIA__CCM_BASE_NS                       (0x4C060000u)
  /** Peripheral MEDIA__CCM base pointer */
  #define MEDIA__CCM                               ((CCM_Type *)MEDIA__CCM_BASE)
  /** Peripheral MEDIA__CCM base pointer */
  #define MEDIA__CCM_NS                            ((CCM_Type *)MEDIA__CCM_BASE_NS)
  /** Peripheral SYSCON__CCM base address */
  #define SYSCON__CCM_BASE                         (0x50510000u)
  /** Peripheral SYSCON__CCM base address */
  #define SYSCON__CCM_BASE_NS                      (0x40510000u)
  /** Peripheral SYSCON__CCM base pointer */
  #define SYSCON__CCM                              ((CCM_Type *)SYSCON__CCM_BASE)
  /** Peripheral SYSCON__CCM base pointer */
  #define SYSCON__CCM_NS                           ((CCM_Type *)SYSCON__CCM_BASE_NS)
  /** Peripheral WAKE__CCM base address */
  #define WAKE__CCM_BASE                           (0x56060000u)
  /** Peripheral WAKE__CCM base address */
  #define WAKE__CCM_BASE_NS                        (0x46060000u)
  /** Peripheral WAKE__CCM base pointer */
  #define WAKE__CCM                                ((CCM_Type *)WAKE__CCM_BASE)
  /** Peripheral WAKE__CCM base pointer */
  #define WAKE__CCM_NS                             ((CCM_Type *)WAKE__CCM_BASE_NS)
  /** Array initializer of CCM peripheral base addresses */
  #define CCM_BASE_ADDRS                           { AUDIO__CCM_BASE, CMPT__CCM_BASE, COMM__CCM_BASE, MAIN__CCM_BASE, MEDIA__CCM_BASE, SYSCON__CCM_BASE, WAKE__CCM_BASE }
  /** Array initializer of CCM peripheral base pointers */
  #define CCM_BASE_PTRS                            { AUDIO__CCM, CMPT__CCM, COMM__CCM, MAIN__CCM, MEDIA__CCM, SYSCON__CCM, WAKE__CCM }
  /** Array initializer of CCM peripheral base addresses */
  #define CCM_BASE_ADDRS_NS                        { AUDIO__CCM_BASE_NS, CMPT__CCM_BASE_NS, COMM__CCM_BASE_NS, MAIN__CCM_BASE_NS, MEDIA__CCM_BASE_NS, SYSCON__CCM_BASE_NS, WAKE__CCM_BASE_NS }
  /** Array initializer of CCM peripheral base pointers */
  #define CCM_BASE_PTRS_NS                         { AUDIO__CCM_NS, CMPT__CCM_NS, COMM__CCM_NS, MAIN__CCM_NS, MEDIA__CCM_NS, SYSCON__CCM_NS, WAKE__CCM_NS }
#else
  /** Peripheral AUDIO__CCM base address */
  #define AUDIO__CCM_BASE                          (0x48060000u)
  /** Peripheral AUDIO__CCM base pointer */
  #define AUDIO__CCM                               ((CCM_Type *)AUDIO__CCM_BASE)
  /** Peripheral CMPT__CCM base address */
  #define CMPT__CCM_BASE                           (0x44060000u)
  /** Peripheral CMPT__CCM base pointer */
  #define CMPT__CCM                                ((CCM_Type *)CMPT__CCM_BASE)
  /** Peripheral COMM__CCM base address */
  #define COMM__CCM_BASE                           (0x4A060000u)
  /** Peripheral COMM__CCM base pointer */
  #define COMM__CCM                                ((CCM_Type *)COMM__CCM_BASE)
  /** Peripheral MAIN__CCM base address */
  #define MAIN__CCM_BASE                           (0x40060000u)
  /** Peripheral MAIN__CCM base pointer */
  #define MAIN__CCM                                ((CCM_Type *)MAIN__CCM_BASE)
  /** Peripheral MEDIA__CCM base address */
  #define MEDIA__CCM_BASE                          (0x4C060000u)
  /** Peripheral MEDIA__CCM base pointer */
  #define MEDIA__CCM                               ((CCM_Type *)MEDIA__CCM_BASE)
  /** Peripheral SYSCON__CCM base address */
  #define SYSCON__CCM_BASE                         (0x40510000u)
  /** Peripheral SYSCON__CCM base pointer */
  #define SYSCON__CCM                              ((CCM_Type *)SYSCON__CCM_BASE)
  /** Peripheral WAKE__CCM base address */
  #define WAKE__CCM_BASE                           (0x46060000u)
  /** Peripheral WAKE__CCM base pointer */
  #define WAKE__CCM                                ((CCM_Type *)WAKE__CCM_BASE)
  /** Array initializer of CCM peripheral base addresses */
  #define CCM_BASE_ADDRS                           { AUDIO__CCM_BASE, CMPT__CCM_BASE, COMM__CCM_BASE, MAIN__CCM_BASE, MEDIA__CCM_BASE, SYSCON__CCM_BASE, WAKE__CCM_BASE }
  /** Array initializer of CCM peripheral base pointers */
  #define CCM_BASE_PTRS                            { AUDIO__CCM, CMPT__CCM, COMM__CCM, MAIN__CCM, MEDIA__CCM, SYSCON__CCM, WAKE__CCM }
#endif

/* CGUANA - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON__CGUANA base address */
  #define SYSCON__CGUANA_BASE                      (0x50500000u)
  /** Peripheral SYSCON__CGUANA base address */
  #define SYSCON__CGUANA_BASE_NS                   (0x40500000u)
  /** Peripheral SYSCON__CGUANA base pointer */
  #define SYSCON__CGUANA                           ((CGUANA_Type *)SYSCON__CGUANA_BASE)
  /** Peripheral SYSCON__CGUANA base pointer */
  #define SYSCON__CGUANA_NS                        ((CGUANA_Type *)SYSCON__CGUANA_BASE_NS)
  /** Array initializer of CGUANA peripheral base addresses */
  #define CGUANA_BASE_ADDRS                        { SYSCON__CGUANA_BASE }
  /** Array initializer of CGUANA peripheral base pointers */
  #define CGUANA_BASE_PTRS                         { SYSCON__CGUANA }
  /** Array initializer of CGUANA peripheral base addresses */
  #define CGUANA_BASE_ADDRS_NS                     { SYSCON__CGUANA_BASE_NS }
  /** Array initializer of CGUANA peripheral base pointers */
  #define CGUANA_BASE_PTRS_NS                      { SYSCON__CGUANA_NS }
#else
  /** Peripheral SYSCON__CGUANA base address */
  #define SYSCON__CGUANA_BASE                      (0x40500000u)
  /** Peripheral SYSCON__CGUANA base pointer */
  #define SYSCON__CGUANA                           ((CGUANA_Type *)SYSCON__CGUANA_BASE)
  /** Array initializer of CGUANA peripheral base addresses */
  #define CGUANA_BASE_ADDRS                        { SYSCON__CGUANA_BASE }
  /** Array initializer of CGUANA peripheral base pointers */
  #define CGUANA_BASE_PTRS                         { SYSCON__CGUANA }
#endif

