zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/MIMXRT2662_COMMON.h
/* CMP - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral WAKE__ACMP_0 base address */
  #define WAKE__ACMP_0_BASE                        (0x560D0000u)
  /** Peripheral WAKE__ACMP_0 base address */
  #define WAKE__ACMP_0_BASE_NS                     (0x460D0000u)
  /** Peripheral WAKE__ACMP_0 base pointer */
  #define WAKE__ACMP_0                             ((CMP_Type *)WAKE__ACMP_0_BASE)
  /** Peripheral WAKE__ACMP_0 base pointer */
  #define WAKE__ACMP_0_NS                          ((CMP_Type *)WAKE__ACMP_0_BASE_NS)
  /** Peripheral WAKE__ACMP_1 base address */
  #define WAKE__ACMP_1_BASE                        (0x560E0000u)
  /** Peripheral WAKE__ACMP_1 base address */
  #define WAKE__ACMP_1_BASE_NS                     (0x460E0000u)
  /** Peripheral WAKE__ACMP_1 base pointer */
  #define WAKE__ACMP_1                             ((CMP_Type *)WAKE__ACMP_1_BASE)
  /** Peripheral WAKE__ACMP_1 base pointer */
  #define WAKE__ACMP_1_NS                          ((CMP_Type *)WAKE__ACMP_1_BASE_NS)
  /** Peripheral WAKE__ACMP_2 base address */
  #define WAKE__ACMP_2_BASE                        (0x560F0000u)
  /** Peripheral WAKE__ACMP_2 base address */
  #define WAKE__ACMP_2_BASE_NS                     (0x460F0000u)
  /** Peripheral WAKE__ACMP_2 base pointer */
  #define WAKE__ACMP_2                             ((CMP_Type *)WAKE__ACMP_2_BASE)
  /** Peripheral WAKE__ACMP_2 base pointer */
  #define WAKE__ACMP_2_NS                          ((CMP_Type *)WAKE__ACMP_2_BASE_NS)
  /** Peripheral WAKE__ACMP_3 base address */
  #define WAKE__ACMP_3_BASE                        (0x56100000u)
  /** Peripheral WAKE__ACMP_3 base address */
  #define WAKE__ACMP_3_BASE_NS                     (0x46100000u)
  /** Peripheral WAKE__ACMP_3 base pointer */
  #define WAKE__ACMP_3                             ((CMP_Type *)WAKE__ACMP_3_BASE)
  /** Peripheral WAKE__ACMP_3 base pointer */
  #define WAKE__ACMP_3_NS                          ((CMP_Type *)WAKE__ACMP_3_BASE_NS)
  /** Array initializer of CMP peripheral base addresses */
  #define CMP_BASE_ADDRS                           { WAKE__ACMP_0_BASE, WAKE__ACMP_1_BASE, WAKE__ACMP_2_BASE, WAKE__ACMP_3_BASE }
  /** Array initializer of CMP peripheral base pointers */
  #define CMP_BASE_PTRS                            { WAKE__ACMP_0, WAKE__ACMP_1, WAKE__ACMP_2, WAKE__ACMP_3 }
  /** Array initializer of CMP peripheral base addresses */
  #define CMP_BASE_ADDRS_NS                        { WAKE__ACMP_0_BASE_NS, WAKE__ACMP_1_BASE_NS, WAKE__ACMP_2_BASE_NS, WAKE__ACMP_3_BASE_NS }
  /** Array initializer of CMP peripheral base pointers */
  #define CMP_BASE_PTRS_NS                         { WAKE__ACMP_0_NS, WAKE__ACMP_1_NS, WAKE__ACMP_2_NS, WAKE__ACMP_3_NS }
#else
  /** Peripheral WAKE__ACMP_0 base address */
  #define WAKE__ACMP_0_BASE                        (0x460D0000u)
  /** Peripheral WAKE__ACMP_0 base pointer */
  #define WAKE__ACMP_0                             ((CMP_Type *)WAKE__ACMP_0_BASE)
  /** Peripheral WAKE__ACMP_1 base address */
  #define WAKE__ACMP_1_BASE                        (0x460E0000u)
  /** Peripheral WAKE__ACMP_1 base pointer */
  #define WAKE__ACMP_1                             ((CMP_Type *)WAKE__ACMP_1_BASE)
  /** Peripheral WAKE__ACMP_2 base address */
  #define WAKE__ACMP_2_BASE                        (0x460F0000u)
  /** Peripheral WAKE__ACMP_2 base pointer */
  #define WAKE__ACMP_2                             ((CMP_Type *)WAKE__ACMP_2_BASE)
  /** Peripheral WAKE__ACMP_3 base address */
  #define WAKE__ACMP_3_BASE                        (0x46100000u)
  /** Peripheral WAKE__ACMP_3 base pointer */
  #define WAKE__ACMP_3                             ((CMP_Type *)WAKE__ACMP_3_BASE)
  /** Array initializer of CMP peripheral base addresses */
  #define CMP_BASE_ADDRS                           { WAKE__ACMP_0_BASE, WAKE__ACMP_1_BASE, WAKE__ACMP_2_BASE, WAKE__ACMP_3_BASE }
  /** Array initializer of CMP peripheral base pointers */
  #define CMP_BASE_PTRS                            { WAKE__ACMP_0, WAKE__ACMP_1, WAKE__ACMP_2, WAKE__ACMP_3 }
#endif
/** Interrupt vectors for the CMP peripheral type */
#define CMP_IRQS                                 { WAKE_ACMP0_IRQn, WAKE_ACMP1_IRQn, WAKE_ACMP2_IRQn, WAKE_ACMP3_IRQn }

/* CRC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__CRC base address */
  #define HSP__CRC_BASE                            (0x52980000u)
  /** Peripheral HSP__CRC base address */
  #define HSP__CRC_BASE_NS                         (0x42980000u)
  /** Peripheral HSP__CRC base pointer */
  #define HSP__CRC                                 ((CRC_Type *)HSP__CRC_BASE)
  /** Peripheral HSP__CRC base pointer */
  #define HSP__CRC_NS                              ((CRC_Type *)HSP__CRC_BASE_NS)
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS                           { HSP__CRC_BASE }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS                            { HSP__CRC }
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS_NS                        { HSP__CRC_BASE_NS }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS_NS                         { HSP__CRC_NS }
#else
  /** Peripheral HSP__CRC base address */
  #define HSP__CRC_BASE                            (0x42980000u)
  /** Peripheral HSP__CRC base pointer */
  #define HSP__CRC                                 ((CRC_Type *)HSP__CRC_BASE)
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS                           { HSP__CRC_BASE }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS                            { HSP__CRC }
#endif

/* CSI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MEDIA__CSI base address */
  #define MEDIA__CSI_BASE                          (0x5C090000u)
  /** Peripheral MEDIA__CSI base address */
  #define MEDIA__CSI_BASE_NS                       (0x4C090000u)
  /** Peripheral MEDIA__CSI base pointer */
  #define MEDIA__CSI                               ((CSI_Type *)MEDIA__CSI_BASE)
  /** Peripheral MEDIA__CSI base pointer */
  #define MEDIA__CSI_NS                            ((CSI_Type *)MEDIA__CSI_BASE_NS)
  /** Array initializer of CSI peripheral base addresses */
  #define CSI_BASE_ADDRS                           { MEDIA__CSI_BASE }
  /** Array initializer of CSI peripheral base pointers */
  #define CSI_BASE_PTRS                            { MEDIA__CSI }
  /** Array initializer of CSI peripheral base addresses */
  #define CSI_BASE_ADDRS_NS                        { MEDIA__CSI_BASE_NS }
  /** Array initializer of CSI peripheral base pointers */
  #define CSI_BASE_PTRS_NS                         { MEDIA__CSI_NS }
#else
  /** Peripheral MEDIA__CSI base address */
  #define MEDIA__CSI_BASE                          (0x4C090000u)
  /** Peripheral MEDIA__CSI base pointer */
  #define MEDIA__CSI                               ((CSI_Type *)MEDIA__CSI_BASE)
  /** Array initializer of CSI peripheral base addresses */
  #define CSI_BASE_ADDRS                           { MEDIA__CSI_BASE }
  /** Array initializer of CSI peripheral base pointers */
  #define CSI_BASE_PTRS                            { MEDIA__CSI }
#endif
/** Interrupt vectors for the CSI peripheral type */
#define CSI_IRQS                                 { MEDIA_CSI_IRQn }

