zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/MIMXRT2662_COMMON.h
/* LPUART - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__LPUART_0 base address */
  #define HSP__LPUART_0_BASE                       (0x52190000u)
  /** Peripheral HSP__LPUART_0 base address */
  #define HSP__LPUART_0_BASE_NS                    (0x42190000u)
  /** Peripheral HSP__LPUART_0 base pointer */
  #define HSP__LPUART_0                            ((LPUART_Type *)HSP__LPUART_0_BASE)
  /** Peripheral HSP__LPUART_0 base pointer */
  #define HSP__LPUART_0_NS                         ((LPUART_Type *)HSP__LPUART_0_BASE_NS)
  /** Peripheral HSP__LPUART_1 base address */
  #define HSP__LPUART_1_BASE                       (0x521A0000u)
  /** Peripheral HSP__LPUART_1 base address */
  #define HSP__LPUART_1_BASE_NS                    (0x421A0000u)
  /** Peripheral HSP__LPUART_1 base pointer */
  #define HSP__LPUART_1                            ((LPUART_Type *)HSP__LPUART_1_BASE)
  /** Peripheral HSP__LPUART_1 base pointer */
  #define HSP__LPUART_1_NS                         ((LPUART_Type *)HSP__LPUART_1_BASE_NS)
  /** Peripheral HSP__LPUART_2 base address */
  #define HSP__LPUART_2_BASE                       (0x521B0000u)
  /** Peripheral HSP__LPUART_2 base address */
  #define HSP__LPUART_2_BASE_NS                    (0x421B0000u)
  /** Peripheral HSP__LPUART_2 base pointer */
  #define HSP__LPUART_2                            ((LPUART_Type *)HSP__LPUART_2_BASE)
  /** Peripheral HSP__LPUART_2 base pointer */
  #define HSP__LPUART_2_NS                         ((LPUART_Type *)HSP__LPUART_2_BASE_NS)
  /** Peripheral HSP__LPUART_3 base address */
  #define HSP__LPUART_3_BASE                       (0x52950000u)
  /** Peripheral HSP__LPUART_3 base address */
  #define HSP__LPUART_3_BASE_NS                    (0x42950000u)
  /** Peripheral HSP__LPUART_3 base pointer */
  #define HSP__LPUART_3                            ((LPUART_Type *)HSP__LPUART_3_BASE)
  /** Peripheral HSP__LPUART_3 base pointer */
  #define HSP__LPUART_3_NS                         ((LPUART_Type *)HSP__LPUART_3_BASE_NS)
  /** Peripheral HSP__LPUART_4 base address */
  #define HSP__LPUART_4_BASE                       (0x52960000u)
  /** Peripheral HSP__LPUART_4 base address */
  #define HSP__LPUART_4_BASE_NS                    (0x42960000u)
  /** Peripheral HSP__LPUART_4 base pointer */
  #define HSP__LPUART_4                            ((LPUART_Type *)HSP__LPUART_4_BASE)
  /** Peripheral HSP__LPUART_4 base pointer */
  #define HSP__LPUART_4_NS                         ((LPUART_Type *)HSP__LPUART_4_BASE_NS)
  /** Peripheral HSP__LPUART_5 base address */
  #define HSP__LPUART_5_BASE                       (0x52970000u)
  /** Peripheral HSP__LPUART_5 base address */
  #define HSP__LPUART_5_BASE_NS                    (0x42970000u)
  /** Peripheral HSP__LPUART_5 base pointer */
  #define HSP__LPUART_5                            ((LPUART_Type *)HSP__LPUART_5_BASE)
  /** Peripheral HSP__LPUART_5 base pointer */
  #define HSP__LPUART_5_NS                         ((LPUART_Type *)HSP__LPUART_5_BASE_NS)
  /** Peripheral WAKE__LPUART_0 base address */
  #define WAKE__LPUART_0_BASE                      (0x561F0000u)
  /** Peripheral WAKE__LPUART_0 base address */
  #define WAKE__LPUART_0_BASE_NS                   (0x461F0000u)
  /** Peripheral WAKE__LPUART_0 base pointer */
  #define WAKE__LPUART_0                           ((LPUART_Type *)WAKE__LPUART_0_BASE)
  /** Peripheral WAKE__LPUART_0 base pointer */
  #define WAKE__LPUART_0_NS                        ((LPUART_Type *)WAKE__LPUART_0_BASE_NS)
  /** Peripheral WAKE__LPUART_1 base address */
  #define WAKE__LPUART_1_BASE                      (0x56200000u)
  /** Peripheral WAKE__LPUART_1 base address */
  #define WAKE__LPUART_1_BASE_NS                   (0x46200000u)
  /** Peripheral WAKE__LPUART_1 base pointer */
  #define WAKE__LPUART_1                           ((LPUART_Type *)WAKE__LPUART_1_BASE)
  /** Peripheral WAKE__LPUART_1 base pointer */
  #define WAKE__LPUART_1_NS                        ((LPUART_Type *)WAKE__LPUART_1_BASE_NS)
  /** Array initializer of LPUART peripheral base addresses */
  #define LPUART_BASE_ADDRS                        { HSP__LPUART_0_BASE, HSP__LPUART_1_BASE, HSP__LPUART_2_BASE, HSP__LPUART_3_BASE, HSP__LPUART_4_BASE, HSP__LPUART_5_BASE, WAKE__LPUART_0_BASE, WAKE__LPUART_1_BASE }
  /** Array initializer of LPUART peripheral base pointers */
  #define LPUART_BASE_PTRS                         { HSP__LPUART_0, HSP__LPUART_1, HSP__LPUART_2, HSP__LPUART_3, HSP__LPUART_4, HSP__LPUART_5, WAKE__LPUART_0, WAKE__LPUART_1 }
  /** Array initializer of LPUART peripheral base addresses */
  #define LPUART_BASE_ADDRS_NS                     { HSP__LPUART_0_BASE_NS, HSP__LPUART_1_BASE_NS, HSP__LPUART_2_BASE_NS, HSP__LPUART_3_BASE_NS, HSP__LPUART_4_BASE_NS, HSP__LPUART_5_BASE_NS, WAKE__LPUART_0_BASE_NS, WAKE__LPUART_1_BASE_NS }
  /** Array initializer of LPUART peripheral base pointers */
  #define LPUART_BASE_PTRS_NS                      { HSP__LPUART_0_NS, HSP__LPUART_1_NS, HSP__LPUART_2_NS, HSP__LPUART_3_NS, HSP__LPUART_4_NS, HSP__LPUART_5_NS, WAKE__LPUART_0_NS, WAKE__LPUART_1_NS }
#else
  /** Peripheral HSP__LPUART_0 base address */
  #define HSP__LPUART_0_BASE                       (0x42190000u)
  /** Peripheral HSP__LPUART_0 base pointer */
  #define HSP__LPUART_0                            ((LPUART_Type *)HSP__LPUART_0_BASE)
  /** Peripheral HSP__LPUART_1 base address */
  #define HSP__LPUART_1_BASE                       (0x421A0000u)
  /** Peripheral HSP__LPUART_1 base pointer */
  #define HSP__LPUART_1                            ((LPUART_Type *)HSP__LPUART_1_BASE)
  /** Peripheral HSP__LPUART_2 base address */
  #define HSP__LPUART_2_BASE                       (0x421B0000u)
  /** Peripheral HSP__LPUART_2 base pointer */
  #define HSP__LPUART_2                            ((LPUART_Type *)HSP__LPUART_2_BASE)
  /** Peripheral HSP__LPUART_3 base address */
  #define HSP__LPUART_3_BASE                       (0x42950000u)
  /** Peripheral HSP__LPUART_3 base pointer */
  #define HSP__LPUART_3                            ((LPUART_Type *)HSP__LPUART_3_BASE)
  /** Peripheral HSP__LPUART_4 base address */
  #define HSP__LPUART_4_BASE                       (0x42960000u)
  /** Peripheral HSP__LPUART_4 base pointer */
  #define HSP__LPUART_4                            ((LPUART_Type *)HSP__LPUART_4_BASE)
  /** Peripheral HSP__LPUART_5 base address */
  #define HSP__LPUART_5_BASE                       (0x42970000u)
  /** Peripheral HSP__LPUART_5 base pointer */
  #define HSP__LPUART_5                            ((LPUART_Type *)HSP__LPUART_5_BASE)
  /** Peripheral WAKE__LPUART_0 base address */
  #define WAKE__LPUART_0_BASE                      (0x461F0000u)
  /** Peripheral WAKE__LPUART_0 base pointer */
  #define WAKE__LPUART_0                           ((LPUART_Type *)WAKE__LPUART_0_BASE)
  /** Peripheral WAKE__LPUART_1 base address */
  #define WAKE__LPUART_1_BASE                      (0x46200000u)
  /** Peripheral WAKE__LPUART_1 base pointer */
  #define WAKE__LPUART_1                           ((LPUART_Type *)WAKE__LPUART_1_BASE)
  /** Array initializer of LPUART peripheral base addresses */
  #define LPUART_BASE_ADDRS                        { HSP__LPUART_0_BASE, HSP__LPUART_1_BASE, HSP__LPUART_2_BASE, HSP__LPUART_3_BASE, HSP__LPUART_4_BASE, HSP__LPUART_5_BASE, WAKE__LPUART_0_BASE, WAKE__LPUART_1_BASE }
  /** Array initializer of LPUART peripheral base pointers */
  #define LPUART_BASE_PTRS                         { HSP__LPUART_0, HSP__LPUART_1, HSP__LPUART_2, HSP__LPUART_3, HSP__LPUART_4, HSP__LPUART_5, WAKE__LPUART_0, WAKE__LPUART_1 }
#endif
/** Interrupt vectors for the LPUART peripheral type */
#define LPUART_RX_TX_IRQS                        { HSP_LPUART0_IRQn, HSP_LPUART1_IRQn, HSP_LPUART2_IRQn, HSP_LPUART3_IRQn, HSP_LPUART4_IRQn, HSP_LPUART5_IRQn, WAKE_LPUART0_IRQn, WAKE_LPUART1_IRQn }

/* MCM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CMPT__CM85_MCM base address */
  #define CMPT__CM85_MCM_BASE                      (0xF0050000u)
  /** Peripheral CMPT__CM85_MCM base address */
  #define CMPT__CM85_MCM_BASE_NS                   (0xE0050000u)
  /** Peripheral CMPT__CM85_MCM base pointer */
  #define CMPT__CM85_MCM                           ((MCM_Type *)CMPT__CM85_MCM_BASE)
  /** Peripheral CMPT__CM85_MCM base pointer */
  #define CMPT__CM85_MCM_NS                        ((MCM_Type *)CMPT__CM85_MCM_BASE_NS)
  /** Array initializer of MCM peripheral base addresses */
  #define MCM_BASE_ADDRS                           { CMPT__CM85_MCM_BASE }
  /** Array initializer of MCM peripheral base pointers */
  #define MCM_BASE_PTRS                            { CMPT__CM85_MCM }
  /** Array initializer of MCM peripheral base addresses */
  #define MCM_BASE_ADDRS_NS                        { CMPT__CM85_MCM_BASE_NS }
  /** Array initializer of MCM peripheral base pointers */
  #define MCM_BASE_PTRS_NS                         { CMPT__CM85_MCM_NS }
#else
  /** Peripheral CMPT__CM85_MCM base address */
  #define CMPT__CM85_MCM_BASE                      (0xE0050000u)
  /** Peripheral CMPT__CM85_MCM base pointer */
  #define CMPT__CM85_MCM                           ((MCM_Type *)CMPT__CM85_MCM_BASE)
  /** Array initializer of MCM peripheral base addresses */
  #define MCM_BASE_ADDRS                           { CMPT__CM85_MCM_BASE }
  /** Array initializer of MCM peripheral base pointers */
  #define MCM_BASE_PTRS                            { CMPT__CM85_MCM }
#endif

