zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/MIMXRT2662_COMMON.h
/* MIPI_CSI2RX - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CSI2_RX_BASE base address */
  #define CSI2_RX_BASE_BASE                        (0x5C0B0000u)
  /** Peripheral CSI2_RX_BASE base address */
  #define CSI2_RX_BASE_BASE_NS                     (0x4C0B0000u)
  /** Peripheral CSI2_RX_BASE base pointer */
  #define CSI2_RX_BASE                             ((MIPI_CSI2RX_Type *)CSI2_RX_BASE_BASE)
  /** Peripheral CSI2_RX_BASE base pointer */
  #define CSI2_RX_BASE_NS                          ((MIPI_CSI2RX_Type *)CSI2_RX_BASE_BASE_NS)
  /** Array initializer of MIPI_CSI2RX peripheral base addresses */
  #define MIPI_CSI2RX_BASE_ADDRS                   { CSI2_RX_BASE_BASE }
  /** Array initializer of MIPI_CSI2RX peripheral base pointers */
  #define MIPI_CSI2RX_BASE_PTRS                    { CSI2_RX_BASE }
  /** Array initializer of MIPI_CSI2RX peripheral base addresses */
  #define MIPI_CSI2RX_BASE_ADDRS_NS                { CSI2_RX_BASE_BASE_NS }
  /** Array initializer of MIPI_CSI2RX peripheral base pointers */
  #define MIPI_CSI2RX_BASE_PTRS_NS                 { CSI2_RX_BASE_NS }
#else
  /** Peripheral CSI2_RX_BASE base address */
  #define CSI2_RX_BASE_BASE                        (0x4C0B0000u)
  /** Peripheral CSI2_RX_BASE base pointer */
  #define CSI2_RX_BASE                             ((MIPI_CSI2RX_Type *)CSI2_RX_BASE_BASE)
  /** Array initializer of MIPI_CSI2RX peripheral base addresses */
  #define MIPI_CSI2RX_BASE_ADDRS                   { CSI2_RX_BASE_BASE }
  /** Array initializer of MIPI_CSI2RX peripheral base pointers */
  #define MIPI_CSI2RX_BASE_PTRS                    { CSI2_RX_BASE }
#endif
/** Interrupt vectors for the MIPI_CSI2RX peripheral type */
#define MIPI_CSI2RX_IRQS                         { MEDIA_MIPI_CSI_IRQn }

/* MMU - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MAIN__MMU base address */
  #define MAIN__MMU_BASE                           (0x50490000u)
  /** Peripheral MAIN__MMU base address */
  #define MAIN__MMU_BASE_NS                        (0x40490000u)
  /** Peripheral MAIN__MMU base pointer */
  #define MAIN__MMU                                ((MMU_Type *)MAIN__MMU_BASE)
  /** Peripheral MAIN__MMU base pointer */
  #define MAIN__MMU_NS                             ((MMU_Type *)MAIN__MMU_BASE_NS)
  /** Array initializer of MMU peripheral base addresses */
  #define MMU_BASE_ADDRS                           { MAIN__MMU_BASE }
  /** Array initializer of MMU peripheral base pointers */
  #define MMU_BASE_PTRS                            { MAIN__MMU }
  /** Array initializer of MMU peripheral base addresses */
  #define MMU_BASE_ADDRS_NS                        { MAIN__MMU_BASE_NS }
  /** Array initializer of MMU peripheral base pointers */
  #define MMU_BASE_PTRS_NS                         { MAIN__MMU_NS }
#else
  /** Peripheral MAIN__MMU base address */
  #define MAIN__MMU_BASE                           (0x40490000u)
  /** Peripheral MAIN__MMU base pointer */
  #define MAIN__MMU                                ((MMU_Type *)MAIN__MMU_BASE)
  /** Array initializer of MMU peripheral base addresses */
  #define MMU_BASE_ADDRS                           { MAIN__MMU_BASE }
  /** Array initializer of MMU peripheral base pointers */
  #define MMU_BASE_PTRS                            { MAIN__MMU }
#endif
/** Interrupt vectors for the MMU peripheral type */
#define MMU_IRQS                                 { MAIN_MMU_IRQn }

/* MODCON - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AUDIO__MODCON base address */
  #define AUDIO__MODCON_BASE                       (0x58000000u)
  /** Peripheral AUDIO__MODCON base address */
  #define AUDIO__MODCON_BASE_NS                    (0x48000000u)
  /** Peripheral AUDIO__MODCON base pointer */
  #define AUDIO__MODCON                            ((MODCON_Type *)AUDIO__MODCON_BASE)
  /** Peripheral AUDIO__MODCON base pointer */
  #define AUDIO__MODCON_NS                         ((MODCON_Type *)AUDIO__MODCON_BASE_NS)
  /** Peripheral CMPT__MODCON base address */
  #define CMPT__MODCON_BASE                        (0x54000000u)
  /** Peripheral CMPT__MODCON base address */
  #define CMPT__MODCON_BASE_NS                     (0x44000000u)
  /** Peripheral CMPT__MODCON base pointer */
  #define CMPT__MODCON                             ((MODCON_Type *)CMPT__MODCON_BASE)
  /** Peripheral CMPT__MODCON base pointer */
  #define CMPT__MODCON_NS                          ((MODCON_Type *)CMPT__MODCON_BASE_NS)
  /** Peripheral COMM__MODCON base address */
  #define COMM__MODCON_BASE                        (0x5A000000u)
  /** Peripheral COMM__MODCON base address */
  #define COMM__MODCON_BASE_NS                     (0x4A000000u)
  /** Peripheral COMM__MODCON base pointer */
  #define COMM__MODCON                             ((MODCON_Type *)COMM__MODCON_BASE)
  /** Peripheral COMM__MODCON base pointer */
  #define COMM__MODCON_NS                          ((MODCON_Type *)COMM__MODCON_BASE_NS)
  /** Peripheral MAIN__MODCON base address */
  #define MAIN__MODCON_BASE                        (0x50000000u)
  /** Peripheral MAIN__MODCON base address */
  #define MAIN__MODCON_BASE_NS                     (0x40000000u)
  /** Peripheral MAIN__MODCON base pointer */
  #define MAIN__MODCON                             ((MODCON_Type *)MAIN__MODCON_BASE)
  /** Peripheral MAIN__MODCON base pointer */
  #define MAIN__MODCON_NS                          ((MODCON_Type *)MAIN__MODCON_BASE_NS)
  /** Peripheral MEDIA__MODCON base address */
  #define MEDIA__MODCON_BASE                       (0x5C000000u)
  /** Peripheral MEDIA__MODCON base address */
  #define MEDIA__MODCON_BASE_NS                    (0x4C000000u)
  /** Peripheral MEDIA__MODCON base pointer */
  #define MEDIA__MODCON                            ((MODCON_Type *)MEDIA__MODCON_BASE)
  /** Peripheral MEDIA__MODCON base pointer */
  #define MEDIA__MODCON_NS                         ((MODCON_Type *)MEDIA__MODCON_BASE_NS)
  /** Peripheral WAKE__MODCON base address */
  #define WAKE__MODCON_BASE                        (0x56000000u)
  /** Peripheral WAKE__MODCON base address */
  #define WAKE__MODCON_BASE_NS                     (0x46000000u)
  /** Peripheral WAKE__MODCON base pointer */
  #define WAKE__MODCON                             ((MODCON_Type *)WAKE__MODCON_BASE)
  /** Peripheral WAKE__MODCON base pointer */
  #define WAKE__MODCON_NS                          ((MODCON_Type *)WAKE__MODCON_BASE_NS)
  /** Array initializer of MODCON peripheral base addresses */
  #define MODCON_BASE_ADDRS                        { AUDIO__MODCON_BASE, CMPT__MODCON_BASE, COMM__MODCON_BASE, MAIN__MODCON_BASE, MEDIA__MODCON_BASE, WAKE__MODCON_BASE }
  /** Array initializer of MODCON peripheral base pointers */
  #define MODCON_BASE_PTRS                         { AUDIO__MODCON, CMPT__MODCON, COMM__MODCON, MAIN__MODCON, MEDIA__MODCON, WAKE__MODCON }
  /** Array initializer of MODCON peripheral base addresses */
  #define MODCON_BASE_ADDRS_NS                     { AUDIO__MODCON_BASE_NS, CMPT__MODCON_BASE_NS, COMM__MODCON_BASE_NS, MAIN__MODCON_BASE_NS, MEDIA__MODCON_BASE_NS, WAKE__MODCON_BASE_NS }
  /** Array initializer of MODCON peripheral base pointers */
  #define MODCON_BASE_PTRS_NS                      { AUDIO__MODCON_NS, CMPT__MODCON_NS, COMM__MODCON_NS, MAIN__MODCON_NS, MEDIA__MODCON_NS, WAKE__MODCON_NS }
#else
  /** Peripheral AUDIO__MODCON base address */
  #define AUDIO__MODCON_BASE                       (0x48000000u)
  /** Peripheral AUDIO__MODCON base pointer */
  #define AUDIO__MODCON                            ((MODCON_Type *)AUDIO__MODCON_BASE)
  /** Peripheral CMPT__MODCON base address */
  #define CMPT__MODCON_BASE                        (0x44000000u)
  /** Peripheral CMPT__MODCON base pointer */
  #define CMPT__MODCON                             ((MODCON_Type *)CMPT__MODCON_BASE)
  /** Peripheral COMM__MODCON base address */
  #define COMM__MODCON_BASE                        (0x4A000000u)
  /** Peripheral COMM__MODCON base pointer */
  #define COMM__MODCON                             ((MODCON_Type *)COMM__MODCON_BASE)
  /** Peripheral MAIN__MODCON base address */
  #define MAIN__MODCON_BASE                        (0x40000000u)
  /** Peripheral MAIN__MODCON base pointer */
  #define MAIN__MODCON                             ((MODCON_Type *)MAIN__MODCON_BASE)
  /** Peripheral MEDIA__MODCON base address */
  #define MEDIA__MODCON_BASE                       (0x4C000000u)
  /** Peripheral MEDIA__MODCON base pointer */
  #define MEDIA__MODCON                            ((MODCON_Type *)MEDIA__MODCON_BASE)
  /** Peripheral WAKE__MODCON base address */
  #define WAKE__MODCON_BASE                        (0x46000000u)
  /** Peripheral WAKE__MODCON base pointer */
  #define WAKE__MODCON                             ((MODCON_Type *)WAKE__MODCON_BASE)
  /** Array initializer of MODCON peripheral base addresses */
  #define MODCON_BASE_ADDRS                        { AUDIO__MODCON_BASE, CMPT__MODCON_BASE, COMM__MODCON_BASE, MAIN__MODCON_BASE, MEDIA__MODCON_BASE, WAKE__MODCON_BASE }
  /** Array initializer of MODCON peripheral base pointers */
  #define MODCON_BASE_PTRS                         { AUDIO__MODCON, CMPT__MODCON, COMM__MODCON, MAIN__MODCON, MEDIA__MODCON, WAKE__MODCON }
#endif

/* NIC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CMPT__NIC base address */
  #define CMPT__NIC_BASE                           (0x54700000u)
  /** Peripheral CMPT__NIC base address */
  #define CMPT__NIC_BASE_NS                        (0x44700000u)
  /** Peripheral CMPT__NIC base pointer */
  #define CMPT__NIC                                ((NIC_Type *)CMPT__NIC_BASE)
  /** Peripheral CMPT__NIC base pointer */
  #define CMPT__NIC_NS                             ((NIC_Type *)CMPT__NIC_BASE_NS)
  /** Peripheral COMM__NIC base address */
  #define COMM__NIC_BASE                           (0x5A700000u)
  /** Peripheral COMM__NIC base address */
  #define COMM__NIC_BASE_NS                        (0x4A700000u)
  /** Peripheral COMM__NIC base pointer */
  #define COMM__NIC                                ((NIC_Type *)COMM__NIC_BASE)
  /** Peripheral COMM__NIC base pointer */
  #define COMM__NIC_NS                             ((NIC_Type *)COMM__NIC_BASE_NS)
  /** Peripheral MAIN__NIC base address */
  #define MAIN__NIC_BASE                           (0x50700000u)
  /** Peripheral MAIN__NIC base address */
  #define MAIN__NIC_BASE_NS                        (0x40700000u)
  /** Peripheral MAIN__NIC base pointer */
  #define MAIN__NIC                                ((NIC_Type *)MAIN__NIC_BASE)
  /** Peripheral MAIN__NIC base pointer */
  #define MAIN__NIC_NS                             ((NIC_Type *)MAIN__NIC_BASE_NS)
  /** Peripheral MEDIA__NIC base address */
  #define MEDIA__NIC_BASE                          (0x5C700000u)
  /** Peripheral MEDIA__NIC base address */
  #define MEDIA__NIC_BASE_NS                       (0x4C700000u)
  /** Peripheral MEDIA__NIC base pointer */
  #define MEDIA__NIC                               ((NIC_Type *)MEDIA__NIC_BASE)
  /** Peripheral MEDIA__NIC base pointer */
  #define MEDIA__NIC_NS                            ((NIC_Type *)MEDIA__NIC_BASE_NS)
  /** Array initializer of NIC peripheral base addresses */
  #define NIC_BASE_ADDRS                           { CMPT__NIC_BASE, COMM__NIC_BASE, MAIN__NIC_BASE, MEDIA__NIC_BASE }
  /** Array initializer of NIC peripheral base pointers */
  #define NIC_BASE_PTRS                            { CMPT__NIC, COMM__NIC, MAIN__NIC, MEDIA__NIC }
  /** Array initializer of NIC peripheral base addresses */
  #define NIC_BASE_ADDRS_NS                        { CMPT__NIC_BASE_NS, COMM__NIC_BASE_NS, MAIN__NIC_BASE_NS, MEDIA__NIC_BASE_NS }
  /** Array initializer of NIC peripheral base pointers */
  #define NIC_BASE_PTRS_NS                         { CMPT__NIC_NS, COMM__NIC_NS, MAIN__NIC_NS, MEDIA__NIC_NS }
#else
  /** Peripheral CMPT__NIC base address */
  #define CMPT__NIC_BASE                           (0x44700000u)
  /** Peripheral CMPT__NIC base pointer */
  #define CMPT__NIC                                ((NIC_Type *)CMPT__NIC_BASE)
  /** Peripheral COMM__NIC base address */
  #define COMM__NIC_BASE                           (0x4A700000u)
  /** Peripheral COMM__NIC base pointer */
  #define COMM__NIC                                ((NIC_Type *)COMM__NIC_BASE)
  /** Peripheral MAIN__NIC base address */
  #define MAIN__NIC_BASE                           (0x40700000u)
  /** Peripheral MAIN__NIC base pointer */
  #define MAIN__NIC                                ((NIC_Type *)MAIN__NIC_BASE)
  /** Peripheral MEDIA__NIC base address */
  #define MEDIA__NIC_BASE                          (0x4C700000u)
  /** Peripheral MEDIA__NIC base pointer */
  #define MEDIA__NIC                               ((NIC_Type *)MEDIA__NIC_BASE)
  /** Array initializer of NIC peripheral base addresses */
  #define NIC_BASE_ADDRS                           { CMPT__NIC_BASE, COMM__NIC_BASE, MAIN__NIC_BASE, MEDIA__NIC_BASE }
  /** Array initializer of NIC peripheral base pointers */
  #define NIC_BASE_PTRS                            { CMPT__NIC, COMM__NIC, MAIN__NIC, MEDIA__NIC }
#endif

/* PDCON - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON__PDCON base address */
  #define SYSCON__PDCON_BASE                       (0x50550000u)
  /** Peripheral SYSCON__PDCON base address */
  #define SYSCON__PDCON_BASE_NS                    (0x40550000u)
  /** Peripheral SYSCON__PDCON base pointer */
  #define SYSCON__PDCON                            ((PDCON_Type *)SYSCON__PDCON_BASE)
  /** Peripheral SYSCON__PDCON base pointer */
  #define SYSCON__PDCON_NS                         ((PDCON_Type *)SYSCON__PDCON_BASE_NS)
  /** Array initializer of PDCON peripheral base addresses */
  #define PDCON_BASE_ADDRS                         { SYSCON__PDCON_BASE }
  /** Array initializer of PDCON peripheral base pointers */
  #define PDCON_BASE_PTRS                          { SYSCON__PDCON }
  /** Array initializer of PDCON peripheral base addresses */
  #define PDCON_BASE_ADDRS_NS                      { SYSCON__PDCON_BASE_NS }
  /** Array initializer of PDCON peripheral base pointers */
  #define PDCON_BASE_PTRS_NS                       { SYSCON__PDCON_NS }
#else
  /** Peripheral SYSCON__PDCON base address */
  #define SYSCON__PDCON_BASE                       (0x40550000u)
  /** Peripheral SYSCON__PDCON base pointer */
  #define SYSCON__PDCON                            ((PDCON_Type *)SYSCON__PDCON_BASE)
  /** Array initializer of PDCON peripheral base addresses */
  #define PDCON_BASE_ADDRS                         { SYSCON__PDCON_BASE }
  /** Array initializer of PDCON peripheral base pointers */
  #define PDCON_BASE_PTRS                          { SYSCON__PDCON }
#endif

/* PDM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AUDIO__MICFIL base address */
  #define AUDIO__MICFIL_BASE                       (0x58080000u)
  /** Peripheral AUDIO__MICFIL base address */
  #define AUDIO__MICFIL_BASE_NS                    (0x48080000u)
  /** Peripheral AUDIO__MICFIL base pointer */
  #define AUDIO__MICFIL                            ((PDM_Type *)AUDIO__MICFIL_BASE)
  /** Peripheral AUDIO__MICFIL base pointer */
  #define AUDIO__MICFIL_NS                         ((PDM_Type *)AUDIO__MICFIL_BASE_NS)
  /** Peripheral WAKE__MICFIL base address */
  #define WAKE__MICFIL_BASE                        (0x560A0000u)
  /** Peripheral WAKE__MICFIL base address */
  #define WAKE__MICFIL_BASE_NS                     (0x460A0000u)
  /** Peripheral WAKE__MICFIL base pointer */
  #define WAKE__MICFIL                             ((PDM_Type *)WAKE__MICFIL_BASE)
  /** Peripheral WAKE__MICFIL base pointer */
  #define WAKE__MICFIL_NS                          ((PDM_Type *)WAKE__MICFIL_BASE_NS)
  /** Array initializer of PDM peripheral base addresses */
  #define PDM_BASE_ADDRS                           { AUDIO__MICFIL_BASE, WAKE__MICFIL_BASE }
  /** Array initializer of PDM peripheral base pointers */
  #define PDM_BASE_PTRS                            { AUDIO__MICFIL, WAKE__MICFIL }
  /** Array initializer of PDM peripheral base addresses */
  #define PDM_BASE_ADDRS_NS                        { AUDIO__MICFIL_BASE_NS, WAKE__MICFIL_BASE_NS }
  /** Array initializer of PDM peripheral base pointers */
  #define PDM_BASE_PTRS_NS                         { AUDIO__MICFIL_NS, WAKE__MICFIL_NS }
#else
  /** Peripheral AUDIO__MICFIL base address */
  #define AUDIO__MICFIL_BASE                       (0x48080000u)
  /** Peripheral AUDIO__MICFIL base pointer */
  #define AUDIO__MICFIL                            ((PDM_Type *)AUDIO__MICFIL_BASE)
  /** Peripheral WAKE__MICFIL base address */
  #define WAKE__MICFIL_BASE                        (0x460A0000u)
  /** Peripheral WAKE__MICFIL base pointer */
  #define WAKE__MICFIL                             ((PDM_Type *)WAKE__MICFIL_BASE)
  /** Array initializer of PDM peripheral base addresses */
  #define PDM_BASE_ADDRS                           { AUDIO__MICFIL_BASE, WAKE__MICFIL_BASE }
  /** Array initializer of PDM peripheral base pointers */
  #define PDM_BASE_PTRS                            { AUDIO__MICFIL, WAKE__MICFIL }
#endif
/** Interrupt vectors for the PDM peripheral type */
#define PDM_Event_IRQS                           { AUDIO_PDM_EVENT_IRQn, WAKE_PDM_EVENT_IRQn }
#define PDM_Error_IRQS                           { AUDIO_PDM_ERROR_IRQn, WAKE_PDM_ERROR_IRQn }
#define PDM_HWVAD_Event_IRQS                     { NotAvail_IRQn, WAKE_PDM_HWVAD_EVENT_IRQn }
#define PDM_HWVAD_Error_IRQS                     { NotAvail_IRQn, WAKE_PDM_HWVAD_ERROR_IRQn }

/* PMU - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON__PMU base address */
  #define SYSCON__PMU_BASE                         (0x50520000u)
  /** Peripheral SYSCON__PMU base address */
  #define SYSCON__PMU_BASE_NS                      (0x40520000u)
  /** Peripheral SYSCON__PMU base pointer */
  #define SYSCON__PMU                              ((PMU_Type *)SYSCON__PMU_BASE)
  /** Peripheral SYSCON__PMU base pointer */
  #define SYSCON__PMU_NS                           ((PMU_Type *)SYSCON__PMU_BASE_NS)
  /** Array initializer of PMU peripheral base addresses */
  #define PMU_BASE_ADDRS                           { SYSCON__PMU_BASE }
  /** Array initializer of PMU peripheral base pointers */
  #define PMU_BASE_PTRS                            { SYSCON__PMU }
  /** Array initializer of PMU peripheral base addresses */
  #define PMU_BASE_ADDRS_NS                        { SYSCON__PMU_BASE_NS }
  /** Array initializer of PMU peripheral base pointers */
  #define PMU_BASE_PTRS_NS                         { SYSCON__PMU_NS }
#else
  /** Peripheral SYSCON__PMU base address */
  #define SYSCON__PMU_BASE                         (0x40520000u)
  /** Peripheral SYSCON__PMU base pointer */
  #define SYSCON__PMU                              ((PMU_Type *)SYSCON__PMU_BASE)
  /** Array initializer of PMU peripheral base addresses */
  #define PMU_BASE_ADDRS                           { SYSCON__PMU_BASE }
  /** Array initializer of PMU peripheral base pointers */
  #define PMU_BASE_PTRS                            { SYSCON__PMU }
#endif

/* POWERCON_CMC_CTRL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON__POWERCON_CMC0_CTRL base address */
  #define SYSCON__POWERCON_CMC0_CTRL_BASE          (0x50540800u)
  /** Peripheral SYSCON__POWERCON_CMC0_CTRL base address */
  #define SYSCON__POWERCON_CMC0_CTRL_BASE_NS       (0x40540800u)
  /** Peripheral SYSCON__POWERCON_CMC0_CTRL base pointer */
  #define SYSCON__POWERCON_CMC0_CTRL               ((POWERCON_CMC_CTRL_Type *)SYSCON__POWERCON_CMC0_CTRL_BASE)
  /** Peripheral SYSCON__POWERCON_CMC0_CTRL base pointer */
  #define SYSCON__POWERCON_CMC0_CTRL_NS            ((POWERCON_CMC_CTRL_Type *)SYSCON__POWERCON_CMC0_CTRL_BASE_NS)
  /** Peripheral SYSCON__POWERCON_CMC1_CTRL base address */
  #define SYSCON__POWERCON_CMC1_CTRL_BASE          (0x50540C00u)
  /** Peripheral SYSCON__POWERCON_CMC1_CTRL base address */
  #define SYSCON__POWERCON_CMC1_CTRL_BASE_NS       (0x40540C00u)
  /** Peripheral SYSCON__POWERCON_CMC1_CTRL base pointer */
  #define SYSCON__POWERCON_CMC1_CTRL               ((POWERCON_CMC_CTRL_Type *)SYSCON__POWERCON_CMC1_CTRL_BASE)
  /** Peripheral SYSCON__POWERCON_CMC1_CTRL base pointer */
  #define SYSCON__POWERCON_CMC1_CTRL_NS            ((POWERCON_CMC_CTRL_Type *)SYSCON__POWERCON_CMC1_CTRL_BASE_NS)
  /** Peripheral SYSCON__POWERCON_CMC2_CTRL base address */
  #define SYSCON__POWERCON_CMC2_CTRL_BASE          (0x50541000u)
  /** Peripheral SYSCON__POWERCON_CMC2_CTRL base address */
  #define SYSCON__POWERCON_CMC2_CTRL_BASE_NS       (0x40541000u)
  /** Peripheral SYSCON__POWERCON_CMC2_CTRL base pointer */
  #define SYSCON__POWERCON_CMC2_CTRL               ((POWERCON_CMC_CTRL_Type *)SYSCON__POWERCON_CMC2_CTRL_BASE)
  /** Peripheral SYSCON__POWERCON_CMC2_CTRL base pointer */
  #define SYSCON__POWERCON_CMC2_CTRL_NS            ((POWERCON_CMC_CTRL_Type *)SYSCON__POWERCON_CMC2_CTRL_BASE_NS)
  /** Array initializer of POWERCON_CMC_CTRL peripheral base addresses */
  #define POWERCON_CMC_CTRL_BASE_ADDRS             { SYSCON__POWERCON_CMC0_CTRL_BASE, SYSCON__POWERCON_CMC1_CTRL_BASE, SYSCON__POWERCON_CMC2_CTRL_BASE }
  /** Array initializer of POWERCON_CMC_CTRL peripheral base pointers */
  #define POWERCON_CMC_CTRL_BASE_PTRS              { SYSCON__POWERCON_CMC0_CTRL, SYSCON__POWERCON_CMC1_CTRL, SYSCON__POWERCON_CMC2_CTRL }
  /** Array initializer of POWERCON_CMC_CTRL peripheral base addresses */
  #define POWERCON_CMC_CTRL_BASE_ADDRS_NS          { SYSCON__POWERCON_CMC0_CTRL_BASE_NS, SYSCON__POWERCON_CMC1_CTRL_BASE_NS, SYSCON__POWERCON_CMC2_CTRL_BASE_NS }
  /** Array initializer of POWERCON_CMC_CTRL peripheral base pointers */
  #define POWERCON_CMC_CTRL_BASE_PTRS_NS           { SYSCON__POWERCON_CMC0_CTRL_NS, SYSCON__POWERCON_CMC1_CTRL_NS, SYSCON__POWERCON_CMC2_CTRL_NS }
#else
  /** Peripheral SYSCON__POWERCON_CMC0_CTRL base address */
  #define SYSCON__POWERCON_CMC0_CTRL_BASE          (0x40540800u)
  /** Peripheral SYSCON__POWERCON_CMC0_CTRL base pointer */
  #define SYSCON__POWERCON_CMC0_CTRL               ((POWERCON_CMC_CTRL_Type *)SYSCON__POWERCON_CMC0_CTRL_BASE)
  /** Peripheral SYSCON__POWERCON_CMC1_CTRL base address */
  #define SYSCON__POWERCON_CMC1_CTRL_BASE          (0x40540C00u)
  /** Peripheral SYSCON__POWERCON_CMC1_CTRL base pointer */
  #define SYSCON__POWERCON_CMC1_CTRL               ((POWERCON_CMC_CTRL_Type *)SYSCON__POWERCON_CMC1_CTRL_BASE)
  /** Peripheral SYSCON__POWERCON_CMC2_CTRL base address */
  #define SYSCON__POWERCON_CMC2_CTRL_BASE          (0x40541000u)
  /** Peripheral SYSCON__POWERCON_CMC2_CTRL base pointer */
  #define SYSCON__POWERCON_CMC2_CTRL               ((POWERCON_CMC_CTRL_Type *)SYSCON__POWERCON_CMC2_CTRL_BASE)
  /** Array initializer of POWERCON_CMC_CTRL peripheral base addresses */
  #define POWERCON_CMC_CTRL_BASE_ADDRS             { SYSCON__POWERCON_CMC0_CTRL_BASE, SYSCON__POWERCON_CMC1_CTRL_BASE, SYSCON__POWERCON_CMC2_CTRL_BASE }
  /** Array initializer of POWERCON_CMC_CTRL peripheral base pointers */
  #define POWERCON_CMC_CTRL_BASE_PTRS              { SYSCON__POWERCON_CMC0_CTRL, SYSCON__POWERCON_CMC1_CTRL, SYSCON__POWERCON_CMC2_CTRL }
#endif

