zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/MIMXRT2662_COMMON.h
/* REFORMATTER - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MEDIA__REFORMATTER base address */
  #define MEDIA__REFORMATTER_BASE                  (0x5C0F0000u)
  /** Peripheral MEDIA__REFORMATTER base address */
  #define MEDIA__REFORMATTER_BASE_NS               (0x4C0F0000u)
  /** Peripheral MEDIA__REFORMATTER base pointer */
  #define MEDIA__REFORMATTER                       ((REFORMATTER_Type *)MEDIA__REFORMATTER_BASE)
  /** Peripheral MEDIA__REFORMATTER base pointer */
  #define MEDIA__REFORMATTER_NS                    ((REFORMATTER_Type *)MEDIA__REFORMATTER_BASE_NS)
  /** Array initializer of REFORMATTER peripheral base addresses */
  #define REFORMATTER_BASE_ADDRS                   { MEDIA__REFORMATTER_BASE }
  /** Array initializer of REFORMATTER peripheral base pointers */
  #define REFORMATTER_BASE_PTRS                    { MEDIA__REFORMATTER }
  /** Array initializer of REFORMATTER peripheral base addresses */
  #define REFORMATTER_BASE_ADDRS_NS                { MEDIA__REFORMATTER_BASE_NS }
  /** Array initializer of REFORMATTER peripheral base pointers */
  #define REFORMATTER_BASE_PTRS_NS                 { MEDIA__REFORMATTER_NS }
#else
  /** Peripheral MEDIA__REFORMATTER base address */
  #define MEDIA__REFORMATTER_BASE                  (0x4C0F0000u)
  /** Peripheral MEDIA__REFORMATTER base pointer */
  #define MEDIA__REFORMATTER                       ((REFORMATTER_Type *)MEDIA__REFORMATTER_BASE)
  /** Array initializer of REFORMATTER peripheral base addresses */
  #define REFORMATTER_BASE_ADDRS                   { MEDIA__REFORMATTER_BASE }
  /** Array initializer of REFORMATTER peripheral base pointers */
  #define REFORMATTER_BASE_PTRS                    { MEDIA__REFORMATTER }
#endif

/* RESETCON - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON__RESETCON base address */
  #define SYSCON__RESETCON_BASE                    (0x50530000u)
  /** Peripheral SYSCON__RESETCON base address */
  #define SYSCON__RESETCON_BASE_NS                 (0x40530000u)
  /** Peripheral SYSCON__RESETCON base pointer */
  #define SYSCON__RESETCON                         ((RESETCON_Type *)SYSCON__RESETCON_BASE)
  /** Peripheral SYSCON__RESETCON base pointer */
  #define SYSCON__RESETCON_NS                      ((RESETCON_Type *)SYSCON__RESETCON_BASE_NS)
  /** Array initializer of RESETCON peripheral base addresses */
  #define RESETCON_BASE_ADDRS                      { SYSCON__RESETCON_BASE }
  /** Array initializer of RESETCON peripheral base pointers */
  #define RESETCON_BASE_PTRS                       { SYSCON__RESETCON }
  /** Array initializer of RESETCON peripheral base addresses */
  #define RESETCON_BASE_ADDRS_NS                   { SYSCON__RESETCON_BASE_NS }
  /** Array initializer of RESETCON peripheral base pointers */
  #define RESETCON_BASE_PTRS_NS                    { SYSCON__RESETCON_NS }
#else
  /** Peripheral SYSCON__RESETCON base address */
  #define SYSCON__RESETCON_BASE                    (0x40530000u)
  /** Peripheral SYSCON__RESETCON base pointer */
  #define SYSCON__RESETCON                         ((RESETCON_Type *)SYSCON__RESETCON_BASE)
  /** Array initializer of RESETCON peripheral base addresses */
  #define RESETCON_BASE_ADDRS                      { SYSCON__RESETCON_BASE }
  /** Array initializer of RESETCON peripheral base pointers */
  #define RESETCON_BASE_PTRS                       { SYSCON__RESETCON }
#endif

/* ROMCP - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CMPT__ROMCP base address */
  #define CMPT__ROMCP_BASE                         (0x541B0000u)
  /** Peripheral CMPT__ROMCP base address */
  #define CMPT__ROMCP_BASE_NS                      (0x441B0000u)
  /** Peripheral CMPT__ROMCP base pointer */
  #define CMPT__ROMCP                              ((ROMCP_Type *)CMPT__ROMCP_BASE)
  /** Peripheral CMPT__ROMCP base pointer */
  #define CMPT__ROMCP_NS                           ((ROMCP_Type *)CMPT__ROMCP_BASE_NS)
  /** Array initializer of ROMCP peripheral base addresses */
  #define ROMCP_BASE_ADDRS                         { CMPT__ROMCP_BASE }
  /** Array initializer of ROMCP peripheral base pointers */
  #define ROMCP_BASE_PTRS                          { CMPT__ROMCP }
  /** Array initializer of ROMCP peripheral base addresses */
  #define ROMCP_BASE_ADDRS_NS                      { CMPT__ROMCP_BASE_NS }
  /** Array initializer of ROMCP peripheral base pointers */
  #define ROMCP_BASE_PTRS_NS                       { CMPT__ROMCP_NS }
#else
  /** Peripheral CMPT__ROMCP base address */
  #define CMPT__ROMCP_BASE                         (0x441B0000u)
  /** Peripheral CMPT__ROMCP base pointer */
  #define CMPT__ROMCP                              ((ROMCP_Type *)CMPT__ROMCP_BASE)
  /** Array initializer of ROMCP peripheral base addresses */
  #define ROMCP_BASE_ADDRS                         { CMPT__ROMCP_BASE }
  /** Array initializer of ROMCP peripheral base pointers */
  #define ROMCP_BASE_PTRS                          { CMPT__ROMCP }
#endif

/* RTC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral VBAT__RTC base address */
  #define VBAT__RTC_BASE                           (0x56340000u)
  /** Peripheral VBAT__RTC base address */
  #define VBAT__RTC_BASE_NS                        (0x46340000u)
  /** Peripheral VBAT__RTC base pointer */
  #define VBAT__RTC                                ((RTC_Type *)VBAT__RTC_BASE)
  /** Peripheral VBAT__RTC base pointer */
  #define VBAT__RTC_NS                             ((RTC_Type *)VBAT__RTC_BASE_NS)
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS                           { VBAT__RTC_BASE }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS                            { VBAT__RTC }
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS_NS                        { VBAT__RTC_BASE_NS }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS_NS                         { VBAT__RTC_NS }
#else
  /** Peripheral VBAT__RTC base address */
  #define VBAT__RTC_BASE                           (0x46340000u)
  /** Peripheral VBAT__RTC base pointer */
  #define VBAT__RTC                                ((RTC_Type *)VBAT__RTC_BASE)
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS                           { VBAT__RTC_BASE }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS                            { VBAT__RTC }
#endif
/** Interrupt vectors for the RTC peripheral type */
#define RTC_IRQS                                 { VBAT_RTC_IRQn }

