zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/MIMXRT2662_COMMON.h
/* S3MU - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MAIN__SENTMU0_SENTMUA base address */
  #define MAIN__SENTMU0_SENTMUA_BASE               (0x50610000u)
  /** Peripheral MAIN__SENTMU0_SENTMUA base address */
  #define MAIN__SENTMU0_SENTMUA_BASE_NS            (0x40610000u)
  /** Peripheral MAIN__SENTMU0_SENTMUA base pointer */
  #define MAIN__SENTMU0_SENTMUA                    ((S3MU_Type *)MAIN__SENTMU0_SENTMUA_BASE)
  /** Peripheral MAIN__SENTMU0_SENTMUA base pointer */
  #define MAIN__SENTMU0_SENTMUA_NS                 ((S3MU_Type *)MAIN__SENTMU0_SENTMUA_BASE_NS)
  /** Peripheral MAIN__SENTMU1_SENTMUA base address */
  #define MAIN__SENTMU1_SENTMUA_BASE               (0x50620000u)
  /** Peripheral MAIN__SENTMU1_SENTMUA base address */
  #define MAIN__SENTMU1_SENTMUA_BASE_NS            (0x40620000u)
  /** Peripheral MAIN__SENTMU1_SENTMUA base pointer */
  #define MAIN__SENTMU1_SENTMUA                    ((S3MU_Type *)MAIN__SENTMU1_SENTMUA_BASE)
  /** Peripheral MAIN__SENTMU1_SENTMUA base pointer */
  #define MAIN__SENTMU1_SENTMUA_NS                 ((S3MU_Type *)MAIN__SENTMU1_SENTMUA_BASE_NS)
  /** Array initializer of S3MU peripheral base addresses */
  #define S3MU_BASE_ADDRS                          { MAIN__SENTMU0_SENTMUA_BASE, MAIN__SENTMU1_SENTMUA_BASE }
  /** Array initializer of S3MU peripheral base pointers */
  #define S3MU_BASE_PTRS                           { MAIN__SENTMU0_SENTMUA, MAIN__SENTMU1_SENTMUA }
  /** Array initializer of S3MU peripheral base addresses */
  #define S3MU_BASE_ADDRS_NS                       { MAIN__SENTMU0_SENTMUA_BASE_NS, MAIN__SENTMU1_SENTMUA_BASE_NS }
  /** Array initializer of S3MU peripheral base pointers */
  #define S3MU_BASE_PTRS_NS                        { MAIN__SENTMU0_SENTMUA_NS, MAIN__SENTMU1_SENTMUA_NS }
#else
  /** Peripheral MAIN__SENTMU0_SENTMUA base address */
  #define MAIN__SENTMU0_SENTMUA_BASE               (0x40610000u)
  /** Peripheral MAIN__SENTMU0_SENTMUA base pointer */
  #define MAIN__SENTMU0_SENTMUA                    ((S3MU_Type *)MAIN__SENTMU0_SENTMUA_BASE)
  /** Peripheral MAIN__SENTMU1_SENTMUA base address */
  #define MAIN__SENTMU1_SENTMUA_BASE               (0x40620000u)
  /** Peripheral MAIN__SENTMU1_SENTMUA base pointer */
  #define MAIN__SENTMU1_SENTMUA                    ((S3MU_Type *)MAIN__SENTMU1_SENTMUA_BASE)
  /** Array initializer of S3MU peripheral base addresses */
  #define S3MU_BASE_ADDRS                          { MAIN__SENTMU0_SENTMUA_BASE, MAIN__SENTMU1_SENTMUA_BASE }
  /** Array initializer of S3MU peripheral base pointers */
  #define S3MU_BASE_PTRS                           { MAIN__SENTMU0_SENTMUA, MAIN__SENTMU1_SENTMUA }
#endif

/* SINC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__SINC_0 base address */
  #define HSP__SINC_0_BASE                         (0x520E0000u)
  /** Peripheral HSP__SINC_0 base address */
  #define HSP__SINC_0_BASE_NS                      (0x420E0000u)
  /** Peripheral HSP__SINC_0 base pointer */
  #define HSP__SINC_0                              ((SINC_Type *)HSP__SINC_0_BASE)
  /** Peripheral HSP__SINC_0 base pointer */
  #define HSP__SINC_0_NS                           ((SINC_Type *)HSP__SINC_0_BASE_NS)
  /** Peripheral HSP__SINC_1 base address */
  #define HSP__SINC_1_BASE                         (0x528E0000u)
  /** Peripheral HSP__SINC_1 base address */
  #define HSP__SINC_1_BASE_NS                      (0x428E0000u)
  /** Peripheral HSP__SINC_1 base pointer */
  #define HSP__SINC_1                              ((SINC_Type *)HSP__SINC_1_BASE)
  /** Peripheral HSP__SINC_1 base pointer */
  #define HSP__SINC_1_NS                           ((SINC_Type *)HSP__SINC_1_BASE_NS)
  /** Array initializer of SINC peripheral base addresses */
  #define SINC_BASE_ADDRS                          { HSP__SINC_0_BASE, HSP__SINC_1_BASE }
  /** Array initializer of SINC peripheral base pointers */
  #define SINC_BASE_PTRS                           { HSP__SINC_0, HSP__SINC_1 }
  /** Array initializer of SINC peripheral base addresses */
  #define SINC_BASE_ADDRS_NS                       { HSP__SINC_0_BASE_NS, HSP__SINC_1_BASE_NS }
  /** Array initializer of SINC peripheral base pointers */
  #define SINC_BASE_PTRS_NS                        { HSP__SINC_0_NS, HSP__SINC_1_NS }
#else
  /** Peripheral HSP__SINC_0 base address */
  #define HSP__SINC_0_BASE                         (0x420E0000u)
  /** Peripheral HSP__SINC_0 base pointer */
  #define HSP__SINC_0                              ((SINC_Type *)HSP__SINC_0_BASE)
  /** Peripheral HSP__SINC_1 base address */
  #define HSP__SINC_1_BASE                         (0x428E0000u)
  /** Peripheral HSP__SINC_1 base pointer */
  #define HSP__SINC_1                              ((SINC_Type *)HSP__SINC_1_BASE)
  /** Array initializer of SINC peripheral base addresses */
  #define SINC_BASE_ADDRS                          { HSP__SINC_0_BASE, HSP__SINC_1_BASE }
  /** Array initializer of SINC peripheral base pointers */
  #define SINC_BASE_PTRS                           { HSP__SINC_0, HSP__SINC_1 }
#endif
/** Interrupt vectors for the SINC peripheral type */
#define SINC_IRQS                                { { HSP_SINC0_CH0_IRQn, HSP_SINC0_CH1_IRQn, HSP_SINC0_CH2_IRQn, HSP_SINC0_CH3_IRQn }, { HSP_SINC1_CH0_IRQn, HSP_SINC1_CH1_IRQn, HSP_SINC1_CH2_IRQn, HSP_SINC1_CH3_IRQn } }

/* SRAM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral VBAT__SRAM base address */
  #define VBAT__SRAM_BASE                          (0x56300000u)
  /** Peripheral VBAT__SRAM base address */
  #define VBAT__SRAM_BASE_NS                       (0x46300000u)
  /** Peripheral VBAT__SRAM base pointer */
  #define VBAT__SRAM                               ((SRAM_Type *)VBAT__SRAM_BASE)
  /** Peripheral VBAT__SRAM base pointer */
  #define VBAT__SRAM_NS                            ((SRAM_Type *)VBAT__SRAM_BASE_NS)
  /** Array initializer of SRAM peripheral base addresses */
  #define SRAM_BASE_ADDRS                          { VBAT__SRAM_BASE }
  /** Array initializer of SRAM peripheral base pointers */
  #define SRAM_BASE_PTRS                           { VBAT__SRAM }
  /** Array initializer of SRAM peripheral base addresses */
  #define SRAM_BASE_ADDRS_NS                       { VBAT__SRAM_BASE_NS }
  /** Array initializer of SRAM peripheral base pointers */
  #define SRAM_BASE_PTRS_NS                        { VBAT__SRAM_NS }
#else
  /** Peripheral VBAT__SRAM base address */
  #define VBAT__SRAM_BASE                          (0x46300000u)
  /** Peripheral VBAT__SRAM base pointer */
  #define VBAT__SRAM                               ((SRAM_Type *)VBAT__SRAM_BASE)
  /** Array initializer of SRAM peripheral base addresses */
  #define SRAM_BASE_ADDRS                          { VBAT__SRAM_BASE }
  /** Array initializer of SRAM peripheral base pointers */
  #define SRAM_BASE_PTRS                           { VBAT__SRAM }
#endif

