zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/MIMXRT2662_COMMON.h
/* SRAMCTL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CMPT__SRAMCTL_0 base address */
  #define CMPT__SRAMCTL_0_BASE                     (0x54080000u)
  /** Peripheral CMPT__SRAMCTL_0 base address */
  #define CMPT__SRAMCTL_0_BASE_NS                  (0x44080000u)
  /** Peripheral CMPT__SRAMCTL_0 base pointer */
  #define CMPT__SRAMCTL_0                          ((SRAMCTL_Type *)CMPT__SRAMCTL_0_BASE)
  /** Peripheral CMPT__SRAMCTL_0 base pointer */
  #define CMPT__SRAMCTL_0_NS                       ((SRAMCTL_Type *)CMPT__SRAMCTL_0_BASE_NS)
  /** Peripheral CMPT__SRAMCTL_1 base address */
  #define CMPT__SRAMCTL_1_BASE                     (0x54090000u)
  /** Peripheral CMPT__SRAMCTL_1 base address */
  #define CMPT__SRAMCTL_1_BASE_NS                  (0x44090000u)
  /** Peripheral CMPT__SRAMCTL_1 base pointer */
  #define CMPT__SRAMCTL_1                          ((SRAMCTL_Type *)CMPT__SRAMCTL_1_BASE)
  /** Peripheral CMPT__SRAMCTL_1 base pointer */
  #define CMPT__SRAMCTL_1_NS                       ((SRAMCTL_Type *)CMPT__SRAMCTL_1_BASE_NS)
  /** Peripheral CMPT__SRAMCTL_2 base address */
  #define CMPT__SRAMCTL_2_BASE                     (0x540A0000u)
  /** Peripheral CMPT__SRAMCTL_2 base address */
  #define CMPT__SRAMCTL_2_BASE_NS                  (0x440A0000u)
  /** Peripheral CMPT__SRAMCTL_2 base pointer */
  #define CMPT__SRAMCTL_2                          ((SRAMCTL_Type *)CMPT__SRAMCTL_2_BASE)
  /** Peripheral CMPT__SRAMCTL_2 base pointer */
  #define CMPT__SRAMCTL_2_NS                       ((SRAMCTL_Type *)CMPT__SRAMCTL_2_BASE_NS)
  /** Array initializer of SRAMCTL peripheral base addresses */
  #define SRAMCTL_BASE_ADDRS                       { CMPT__SRAMCTL_0_BASE, CMPT__SRAMCTL_1_BASE, CMPT__SRAMCTL_2_BASE }
  /** Array initializer of SRAMCTL peripheral base pointers */
  #define SRAMCTL_BASE_PTRS                        { CMPT__SRAMCTL_0, CMPT__SRAMCTL_1, CMPT__SRAMCTL_2 }
  /** Array initializer of SRAMCTL peripheral base addresses */
  #define SRAMCTL_BASE_ADDRS_NS                    { CMPT__SRAMCTL_0_BASE_NS, CMPT__SRAMCTL_1_BASE_NS, CMPT__SRAMCTL_2_BASE_NS }
  /** Array initializer of SRAMCTL peripheral base pointers */
  #define SRAMCTL_BASE_PTRS_NS                     { CMPT__SRAMCTL_0_NS, CMPT__SRAMCTL_1_NS, CMPT__SRAMCTL_2_NS }
#else
  /** Peripheral CMPT__SRAMCTL_0 base address */
  #define CMPT__SRAMCTL_0_BASE                     (0x44080000u)
  /** Peripheral CMPT__SRAMCTL_0 base pointer */
  #define CMPT__SRAMCTL_0                          ((SRAMCTL_Type *)CMPT__SRAMCTL_0_BASE)
  /** Peripheral CMPT__SRAMCTL_1 base address */
  #define CMPT__SRAMCTL_1_BASE                     (0x44090000u)
  /** Peripheral CMPT__SRAMCTL_1 base pointer */
  #define CMPT__SRAMCTL_1                          ((SRAMCTL_Type *)CMPT__SRAMCTL_1_BASE)
  /** Peripheral CMPT__SRAMCTL_2 base address */
  #define CMPT__SRAMCTL_2_BASE                     (0x440A0000u)
  /** Peripheral CMPT__SRAMCTL_2 base pointer */
  #define CMPT__SRAMCTL_2                          ((SRAMCTL_Type *)CMPT__SRAMCTL_2_BASE)
  /** Array initializer of SRAMCTL peripheral base addresses */
  #define SRAMCTL_BASE_ADDRS                       { CMPT__SRAMCTL_0_BASE, CMPT__SRAMCTL_1_BASE, CMPT__SRAMCTL_2_BASE }
  /** Array initializer of SRAMCTL peripheral base pointers */
  #define SRAMCTL_BASE_PTRS                        { CMPT__SRAMCTL_0, CMPT__SRAMCTL_1, CMPT__SRAMCTL_2 }
#endif

/* STM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__STM base address */
  #define HSP__STM_BASE                            (0x529B0000u)
  /** Peripheral HSP__STM base address */
  #define HSP__STM_BASE_NS                         (0x429B0000u)
  /** Peripheral HSP__STM base pointer */
  #define HSP__STM                                 ((STM_Type *)HSP__STM_BASE)
  /** Peripheral HSP__STM base pointer */
  #define HSP__STM_NS                              ((STM_Type *)HSP__STM_BASE_NS)
  /** Array initializer of STM peripheral base addresses */
  #define STM_BASE_ADDRS                           { HSP__STM_BASE }
  /** Array initializer of STM peripheral base pointers */
  #define STM_BASE_PTRS                            { HSP__STM }
  /** Array initializer of STM peripheral base addresses */
  #define STM_BASE_ADDRS_NS                        { HSP__STM_BASE_NS }
  /** Array initializer of STM peripheral base pointers */
  #define STM_BASE_PTRS_NS                         { HSP__STM_NS }
#else
  /** Peripheral HSP__STM base address */
  #define HSP__STM_BASE                            (0x429B0000u)
  /** Peripheral HSP__STM base pointer */
  #define HSP__STM                                 ((STM_Type *)HSP__STM_BASE)
  /** Array initializer of STM peripheral base addresses */
  #define STM_BASE_ADDRS                           { HSP__STM_BASE }
  /** Array initializer of STM peripheral base pointers */
  #define STM_BASE_PTRS                            { HSP__STM }
#endif
/** Interrupt vectors for the STM peripheral type */
#define STM_IRQS                                 { HSP_STM_IRQn }

/* SWT - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral WAKE__SWT_0 base address */
  #define WAKE__SWT_0_BASE                         (0x56160000u)
  /** Peripheral WAKE__SWT_0 base address */
  #define WAKE__SWT_0_BASE_NS                      (0x46160000u)
  /** Peripheral WAKE__SWT_0 base pointer */
  #define WAKE__SWT_0                              ((SWT_Type *)WAKE__SWT_0_BASE)
  /** Peripheral WAKE__SWT_0 base pointer */
  #define WAKE__SWT_0_NS                           ((SWT_Type *)WAKE__SWT_0_BASE_NS)
  /** Peripheral WAKE__SWT_1 base address */
  #define WAKE__SWT_1_BASE                         (0x56170000u)
  /** Peripheral WAKE__SWT_1 base address */
  #define WAKE__SWT_1_BASE_NS                      (0x46170000u)
  /** Peripheral WAKE__SWT_1 base pointer */
  #define WAKE__SWT_1                              ((SWT_Type *)WAKE__SWT_1_BASE)
  /** Peripheral WAKE__SWT_1 base pointer */
  #define WAKE__SWT_1_NS                           ((SWT_Type *)WAKE__SWT_1_BASE_NS)
  /** Array initializer of SWT peripheral base addresses */
  #define SWT_BASE_ADDRS                           { WAKE__SWT_0_BASE, WAKE__SWT_1_BASE }
  /** Array initializer of SWT peripheral base pointers */
  #define SWT_BASE_PTRS                            { WAKE__SWT_0, WAKE__SWT_1 }
  /** Array initializer of SWT peripheral base addresses */
  #define SWT_BASE_ADDRS_NS                        { WAKE__SWT_0_BASE_NS, WAKE__SWT_1_BASE_NS }
  /** Array initializer of SWT peripheral base pointers */
  #define SWT_BASE_PTRS_NS                         { WAKE__SWT_0_NS, WAKE__SWT_1_NS }
#else
  /** Peripheral WAKE__SWT_0 base address */
  #define WAKE__SWT_0_BASE                         (0x46160000u)
  /** Peripheral WAKE__SWT_0 base pointer */
  #define WAKE__SWT_0                              ((SWT_Type *)WAKE__SWT_0_BASE)
  /** Peripheral WAKE__SWT_1 base address */
  #define WAKE__SWT_1_BASE                         (0x46170000u)
  /** Peripheral WAKE__SWT_1 base pointer */
  #define WAKE__SWT_1                              ((SWT_Type *)WAKE__SWT_1_BASE)
  /** Array initializer of SWT peripheral base addresses */
  #define SWT_BASE_ADDRS                           { WAKE__SWT_0_BASE, WAKE__SWT_1_BASE }
  /** Array initializer of SWT peripheral base pointers */
  #define SWT_BASE_PTRS                            { WAKE__SWT_0, WAKE__SWT_1 }
#endif
/** Interrupt vectors for the SWT peripheral type */
#define SWT_IRQS                                 { WAKE_SWT0_IRQn, WAKE_SWT1_IRQn }

