zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2662/MIMXRT2662_COMMON.h
/* TENBASET_PHY - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral COMM__TENBASET_PHY_0 base address */
  #define COMM__TENBASET_PHY_0_BASE                (0x5A100000u)
  /** Peripheral COMM__TENBASET_PHY_0 base address */
  #define COMM__TENBASET_PHY_0_BASE_NS             (0x4A100000u)
  /** Peripheral COMM__TENBASET_PHY_0 base pointer */
  #define COMM__TENBASET_PHY_0                     ((TENBASET_PHY_Type *)COMM__TENBASET_PHY_0_BASE)
  /** Peripheral COMM__TENBASET_PHY_0 base pointer */
  #define COMM__TENBASET_PHY_0_NS                  ((TENBASET_PHY_Type *)COMM__TENBASET_PHY_0_BASE_NS)
  /** Peripheral COMM__TENBASET_PHY_1 base address */
  #define COMM__TENBASET_PHY_1_BASE                (0x5A110000u)
  /** Peripheral COMM__TENBASET_PHY_1 base address */
  #define COMM__TENBASET_PHY_1_BASE_NS             (0x4A110000u)
  /** Peripheral COMM__TENBASET_PHY_1 base pointer */
  #define COMM__TENBASET_PHY_1                     ((TENBASET_PHY_Type *)COMM__TENBASET_PHY_1_BASE)
  /** Peripheral COMM__TENBASET_PHY_1 base pointer */
  #define COMM__TENBASET_PHY_1_NS                  ((TENBASET_PHY_Type *)COMM__TENBASET_PHY_1_BASE_NS)
  /** Array initializer of TENBASET_PHY peripheral base addresses */
  #define TENBASET_PHY_BASE_ADDRS                  { COMM__TENBASET_PHY_0_BASE, COMM__TENBASET_PHY_1_BASE }
  /** Array initializer of TENBASET_PHY peripheral base pointers */
  #define TENBASET_PHY_BASE_PTRS                   { COMM__TENBASET_PHY_0, COMM__TENBASET_PHY_1 }
  /** Array initializer of TENBASET_PHY peripheral base addresses */
  #define TENBASET_PHY_BASE_ADDRS_NS               { COMM__TENBASET_PHY_0_BASE_NS, COMM__TENBASET_PHY_1_BASE_NS }
  /** Array initializer of TENBASET_PHY peripheral base pointers */
  #define TENBASET_PHY_BASE_PTRS_NS                { COMM__TENBASET_PHY_0_NS, COMM__TENBASET_PHY_1_NS }
#else
  /** Peripheral COMM__TENBASET_PHY_0 base address */
  #define COMM__TENBASET_PHY_0_BASE                (0x4A100000u)
  /** Peripheral COMM__TENBASET_PHY_0 base pointer */
  #define COMM__TENBASET_PHY_0                     ((TENBASET_PHY_Type *)COMM__TENBASET_PHY_0_BASE)
  /** Peripheral COMM__TENBASET_PHY_1 base address */
  #define COMM__TENBASET_PHY_1_BASE                (0x4A110000u)
  /** Peripheral COMM__TENBASET_PHY_1 base pointer */
  #define COMM__TENBASET_PHY_1                     ((TENBASET_PHY_Type *)COMM__TENBASET_PHY_1_BASE)
  /** Array initializer of TENBASET_PHY peripheral base addresses */
  #define TENBASET_PHY_BASE_ADDRS                  { COMM__TENBASET_PHY_0_BASE, COMM__TENBASET_PHY_1_BASE }
  /** Array initializer of TENBASET_PHY peripheral base pointers */
  #define TENBASET_PHY_BASE_PTRS                   { COMM__TENBASET_PHY_0, COMM__TENBASET_PHY_1 }
#endif

/* TINGPU - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MEDIA__TINGPU base address */
  #define MEDIA__TINGPU_BASE                       (0x5C0E0000u)
  /** Peripheral MEDIA__TINGPU base address */
  #define MEDIA__TINGPU_BASE_NS                    (0x4C0E0000u)
  /** Peripheral MEDIA__TINGPU base pointer */
  #define MEDIA__TINGPU                            ((TINGPU_Type *)MEDIA__TINGPU_BASE)
  /** Peripheral MEDIA__TINGPU base pointer */
  #define MEDIA__TINGPU_NS                         ((TINGPU_Type *)MEDIA__TINGPU_BASE_NS)
  /** Array initializer of TINGPU peripheral base addresses */
  #define TINGPU_BASE_ADDRS                        { MEDIA__TINGPU_BASE }
  /** Array initializer of TINGPU peripheral base pointers */
  #define TINGPU_BASE_PTRS                         { MEDIA__TINGPU }
  /** Array initializer of TINGPU peripheral base addresses */
  #define TINGPU_BASE_ADDRS_NS                     { MEDIA__TINGPU_BASE_NS }
  /** Array initializer of TINGPU peripheral base pointers */
  #define TINGPU_BASE_PTRS_NS                      { MEDIA__TINGPU_NS }
#else
  /** Peripheral MEDIA__TINGPU base address */
  #define MEDIA__TINGPU_BASE                       (0x4C0E0000u)
  /** Peripheral MEDIA__TINGPU base pointer */
  #define MEDIA__TINGPU                            ((TINGPU_Type *)MEDIA__TINGPU_BASE)
  /** Array initializer of TINGPU peripheral base addresses */
  #define TINGPU_BASE_ADDRS                        { MEDIA__TINGPU_BASE }
  /** Array initializer of TINGPU peripheral base pointers */
  #define TINGPU_BASE_PTRS                         { MEDIA__TINGPU }
#endif

/* TMR - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__QTMR_0 base address */
  #define HSP__QTMR_0_BASE                         (0x521E0000u)
  /** Peripheral HSP__QTMR_0 base address */
  #define HSP__QTMR_0_BASE_NS                      (0x421E0000u)
  /** Peripheral HSP__QTMR_0 base pointer */
  #define HSP__QTMR_0                              ((TMR_Type *)HSP__QTMR_0_BASE)
  /** Peripheral HSP__QTMR_0 base pointer */
  #define HSP__QTMR_0_NS                           ((TMR_Type *)HSP__QTMR_0_BASE_NS)
  /** Peripheral HSP__QTMR_1 base address */
  #define HSP__QTMR_1_BASE                         (0x521F0000u)
  /** Peripheral HSP__QTMR_1 base address */
  #define HSP__QTMR_1_BASE_NS                      (0x421F0000u)
  /** Peripheral HSP__QTMR_1 base pointer */
  #define HSP__QTMR_1                              ((TMR_Type *)HSP__QTMR_1_BASE)
  /** Peripheral HSP__QTMR_1 base pointer */
  #define HSP__QTMR_1_NS                           ((TMR_Type *)HSP__QTMR_1_BASE_NS)
  /** Peripheral HSP__QTMR_2 base address */
  #define HSP__QTMR_2_BASE                         (0x529E0000u)
  /** Peripheral HSP__QTMR_2 base address */
  #define HSP__QTMR_2_BASE_NS                      (0x429E0000u)
  /** Peripheral HSP__QTMR_2 base pointer */
  #define HSP__QTMR_2                              ((TMR_Type *)HSP__QTMR_2_BASE)
  /** Peripheral HSP__QTMR_2 base pointer */
  #define HSP__QTMR_2_NS                           ((TMR_Type *)HSP__QTMR_2_BASE_NS)
  /** Peripheral HSP__QTMR_3 base address */
  #define HSP__QTMR_3_BASE                         (0x529F0000u)
  /** Peripheral HSP__QTMR_3 base address */
  #define HSP__QTMR_3_BASE_NS                      (0x429F0000u)
  /** Peripheral HSP__QTMR_3 base pointer */
  #define HSP__QTMR_3                              ((TMR_Type *)HSP__QTMR_3_BASE)
  /** Peripheral HSP__QTMR_3 base pointer */
  #define HSP__QTMR_3_NS                           ((TMR_Type *)HSP__QTMR_3_BASE_NS)
  /** Array initializer of TMR peripheral base addresses */
  #define TMR_BASE_ADDRS                           { HSP__QTMR_0_BASE, HSP__QTMR_1_BASE, HSP__QTMR_2_BASE, HSP__QTMR_3_BASE }
  /** Array initializer of TMR peripheral base pointers */
  #define TMR_BASE_PTRS                            { HSP__QTMR_0, HSP__QTMR_1, HSP__QTMR_2, HSP__QTMR_3 }
  /** Array initializer of TMR peripheral base addresses */
  #define TMR_BASE_ADDRS_NS                        { HSP__QTMR_0_BASE_NS, HSP__QTMR_1_BASE_NS, HSP__QTMR_2_BASE_NS, HSP__QTMR_3_BASE_NS }
  /** Array initializer of TMR peripheral base pointers */
  #define TMR_BASE_PTRS_NS                         { HSP__QTMR_0_NS, HSP__QTMR_1_NS, HSP__QTMR_2_NS, HSP__QTMR_3_NS }
#else
  /** Peripheral HSP__QTMR_0 base address */
  #define HSP__QTMR_0_BASE                         (0x421E0000u)
  /** Peripheral HSP__QTMR_0 base pointer */
  #define HSP__QTMR_0                              ((TMR_Type *)HSP__QTMR_0_BASE)
  /** Peripheral HSP__QTMR_1 base address */
  #define HSP__QTMR_1_BASE                         (0x421F0000u)
  /** Peripheral HSP__QTMR_1 base pointer */
  #define HSP__QTMR_1                              ((TMR_Type *)HSP__QTMR_1_BASE)
  /** Peripheral HSP__QTMR_2 base address */
  #define HSP__QTMR_2_BASE                         (0x429E0000u)
  /** Peripheral HSP__QTMR_2 base pointer */
  #define HSP__QTMR_2                              ((TMR_Type *)HSP__QTMR_2_BASE)
  /** Peripheral HSP__QTMR_3 base address */
  #define HSP__QTMR_3_BASE                         (0x429F0000u)
  /** Peripheral HSP__QTMR_3 base pointer */
  #define HSP__QTMR_3                              ((TMR_Type *)HSP__QTMR_3_BASE)
  /** Array initializer of TMR peripheral base addresses */
  #define TMR_BASE_ADDRS                           { HSP__QTMR_0_BASE, HSP__QTMR_1_BASE, HSP__QTMR_2_BASE, HSP__QTMR_3_BASE }
  /** Array initializer of TMR peripheral base pointers */
  #define TMR_BASE_PTRS                            { HSP__QTMR_0, HSP__QTMR_1, HSP__QTMR_2, HSP__QTMR_3 }
#endif
/** Interrupt vectors for the TMR peripheral type */
#define TMR_IRQS                                 { HSP_QTMR0_IRQn, HSP_QTMR1_IRQn, HSP_QTMR2_IRQn, HSP_QTMR3_IRQn }

/* TPM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__TPM_0 base address */
  #define HSP__TPM_0_BASE                          (0x520A0000u)
  /** Peripheral HSP__TPM_0 base address */
  #define HSP__TPM_0_BASE_NS                       (0x420A0000u)
  /** Peripheral HSP__TPM_0 base pointer */
  #define HSP__TPM_0                               ((TPM_Type *)HSP__TPM_0_BASE)
  /** Peripheral HSP__TPM_0 base pointer */
  #define HSP__TPM_0_NS                            ((TPM_Type *)HSP__TPM_0_BASE_NS)
  /** Peripheral HSP__TPM_1 base address */
  #define HSP__TPM_1_BASE                          (0x520A4000u)
  /** Peripheral HSP__TPM_1 base address */
  #define HSP__TPM_1_BASE_NS                       (0x420A4000u)
  /** Peripheral HSP__TPM_1 base pointer */
  #define HSP__TPM_1                               ((TPM_Type *)HSP__TPM_1_BASE)
  /** Peripheral HSP__TPM_1 base pointer */
  #define HSP__TPM_1_NS                            ((TPM_Type *)HSP__TPM_1_BASE_NS)
  /** Peripheral HSP__TPM_2 base address */
  #define HSP__TPM_2_BASE                          (0x520A8000u)
  /** Peripheral HSP__TPM_2 base address */
  #define HSP__TPM_2_BASE_NS                       (0x420A8000u)
  /** Peripheral HSP__TPM_2 base pointer */
  #define HSP__TPM_2                               ((TPM_Type *)HSP__TPM_2_BASE)
  /** Peripheral HSP__TPM_2 base pointer */
  #define HSP__TPM_2_NS                            ((TPM_Type *)HSP__TPM_2_BASE_NS)
  /** Peripheral HSP__TPM_3 base address */
  #define HSP__TPM_3_BASE                          (0x520AC000u)
  /** Peripheral HSP__TPM_3 base address */
  #define HSP__TPM_3_BASE_NS                       (0x420AC000u)
  /** Peripheral HSP__TPM_3 base pointer */
  #define HSP__TPM_3                               ((TPM_Type *)HSP__TPM_3_BASE)
  /** Peripheral HSP__TPM_3 base pointer */
  #define HSP__TPM_3_NS                            ((TPM_Type *)HSP__TPM_3_BASE_NS)
  /** Peripheral WAKE__TPM_0 base address */
  #define WAKE__TPM_0_BASE                         (0x56150000u)
  /** Peripheral WAKE__TPM_0 base address */
  #define WAKE__TPM_0_BASE_NS                      (0x46150000u)
  /** Peripheral WAKE__TPM_0 base pointer */
  #define WAKE__TPM_0                              ((TPM_Type *)WAKE__TPM_0_BASE)
  /** Peripheral WAKE__TPM_0 base pointer */
  #define WAKE__TPM_0_NS                           ((TPM_Type *)WAKE__TPM_0_BASE_NS)
  /** Peripheral WAKE__TPM_1 base address */
  #define WAKE__TPM_1_BASE                         (0x56154000u)
  /** Peripheral WAKE__TPM_1 base address */
  #define WAKE__TPM_1_BASE_NS                      (0x46154000u)
  /** Peripheral WAKE__TPM_1 base pointer */
  #define WAKE__TPM_1                              ((TPM_Type *)WAKE__TPM_1_BASE)
  /** Peripheral WAKE__TPM_1 base pointer */
  #define WAKE__TPM_1_NS                           ((TPM_Type *)WAKE__TPM_1_BASE_NS)
  /** Peripheral WAKE__TPM_2 base address */
  #define WAKE__TPM_2_BASE                         (0x56158000u)
  /** Peripheral WAKE__TPM_2 base address */
  #define WAKE__TPM_2_BASE_NS                      (0x46158000u)
  /** Peripheral WAKE__TPM_2 base pointer */
  #define WAKE__TPM_2                              ((TPM_Type *)WAKE__TPM_2_BASE)
  /** Peripheral WAKE__TPM_2 base pointer */
  #define WAKE__TPM_2_NS                           ((TPM_Type *)WAKE__TPM_2_BASE_NS)
  /** Peripheral WAKE__TPM_3 base address */
  #define WAKE__TPM_3_BASE                         (0x5615C000u)
  /** Peripheral WAKE__TPM_3 base address */
  #define WAKE__TPM_3_BASE_NS                      (0x4615C000u)
  /** Peripheral WAKE__TPM_3 base pointer */
  #define WAKE__TPM_3                              ((TPM_Type *)WAKE__TPM_3_BASE)
  /** Peripheral WAKE__TPM_3 base pointer */
  #define WAKE__TPM_3_NS                           ((TPM_Type *)WAKE__TPM_3_BASE_NS)
  /** Array initializer of TPM peripheral base addresses */
  #define TPM_BASE_ADDRS                           { HSP__TPM_0_BASE, HSP__TPM_1_BASE, HSP__TPM_2_BASE, HSP__TPM_3_BASE, WAKE__TPM_0_BASE, WAKE__TPM_1_BASE, WAKE__TPM_2_BASE, WAKE__TPM_3_BASE }
  /** Array initializer of TPM peripheral base pointers */
  #define TPM_BASE_PTRS                            { HSP__TPM_0, HSP__TPM_1, HSP__TPM_2, HSP__TPM_3, WAKE__TPM_0, WAKE__TPM_1, WAKE__TPM_2, WAKE__TPM_3 }
  /** Array initializer of TPM peripheral base addresses */
  #define TPM_BASE_ADDRS_NS                        { HSP__TPM_0_BASE_NS, HSP__TPM_1_BASE_NS, HSP__TPM_2_BASE_NS, HSP__TPM_3_BASE_NS, WAKE__TPM_0_BASE_NS, WAKE__TPM_1_BASE_NS, WAKE__TPM_2_BASE_NS, WAKE__TPM_3_BASE_NS }
  /** Array initializer of TPM peripheral base pointers */
  #define TPM_BASE_PTRS_NS                         { HSP__TPM_0_NS, HSP__TPM_1_NS, HSP__TPM_2_NS, HSP__TPM_3_NS, WAKE__TPM_0_NS, WAKE__TPM_1_NS, WAKE__TPM_2_NS, WAKE__TPM_3_NS }
#else
  /** Peripheral HSP__TPM_0 base address */
  #define HSP__TPM_0_BASE                          (0x420A0000u)
  /** Peripheral HSP__TPM_0 base pointer */
  #define HSP__TPM_0                               ((TPM_Type *)HSP__TPM_0_BASE)
  /** Peripheral HSP__TPM_1 base address */
  #define HSP__TPM_1_BASE                          (0x420A4000u)
  /** Peripheral HSP__TPM_1 base pointer */
  #define HSP__TPM_1                               ((TPM_Type *)HSP__TPM_1_BASE)
  /** Peripheral HSP__TPM_2 base address */
  #define HSP__TPM_2_BASE                          (0x420A8000u)
  /** Peripheral HSP__TPM_2 base pointer */
  #define HSP__TPM_2                               ((TPM_Type *)HSP__TPM_2_BASE)
  /** Peripheral HSP__TPM_3 base address */
  #define HSP__TPM_3_BASE                          (0x420AC000u)
  /** Peripheral HSP__TPM_3 base pointer */
  #define HSP__TPM_3                               ((TPM_Type *)HSP__TPM_3_BASE)
  /** Peripheral WAKE__TPM_0 base address */
  #define WAKE__TPM_0_BASE                         (0x46150000u)
  /** Peripheral WAKE__TPM_0 base pointer */
  #define WAKE__TPM_0                              ((TPM_Type *)WAKE__TPM_0_BASE)
  /** Peripheral WAKE__TPM_1 base address */
  #define WAKE__TPM_1_BASE                         (0x46154000u)
  /** Peripheral WAKE__TPM_1 base pointer */
  #define WAKE__TPM_1                              ((TPM_Type *)WAKE__TPM_1_BASE)
  /** Peripheral WAKE__TPM_2 base address */
  #define WAKE__TPM_2_BASE                         (0x46158000u)
  /** Peripheral WAKE__TPM_2 base pointer */
  #define WAKE__TPM_2                              ((TPM_Type *)WAKE__TPM_2_BASE)
  /** Peripheral WAKE__TPM_3 base address */
  #define WAKE__TPM_3_BASE                         (0x4615C000u)
  /** Peripheral WAKE__TPM_3 base pointer */
  #define WAKE__TPM_3                              ((TPM_Type *)WAKE__TPM_3_BASE)
  /** Array initializer of TPM peripheral base addresses */
  #define TPM_BASE_ADDRS                           { HSP__TPM_0_BASE, HSP__TPM_1_BASE, HSP__TPM_2_BASE, HSP__TPM_3_BASE, WAKE__TPM_0_BASE, WAKE__TPM_1_BASE, WAKE__TPM_2_BASE, WAKE__TPM_3_BASE }
  /** Array initializer of TPM peripheral base pointers */
  #define TPM_BASE_PTRS                            { HSP__TPM_0, HSP__TPM_1, HSP__TPM_2, HSP__TPM_3, WAKE__TPM_0, WAKE__TPM_1, WAKE__TPM_2, WAKE__TPM_3 }
#endif
/** Interrupt vectors for the TPM peripheral type */
#define TPM_IRQS                                 { HSP_QTPM0_IRQn, HSP_QTPM1_IRQn, HSP_QTPM2_IRQn, HSP_QTPM3_IRQn, WAKE_QTPM0_IRQn, WAKE_QTPM1_IRQn, WAKE_QTPM2_IRQn, WAKE_QTPM3_IRQn }

/* TRDC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AUDIO__TRDC base address */
  #define AUDIO__TRDC_BASE                         (0x58040000u)
  /** Peripheral AUDIO__TRDC base address */
  #define AUDIO__TRDC_BASE_NS                      (0x48040000u)
  /** Peripheral AUDIO__TRDC base pointer */
  #define AUDIO__TRDC                              ((TRDC_Type *)AUDIO__TRDC_BASE)
  /** Peripheral AUDIO__TRDC base pointer */
  #define AUDIO__TRDC_NS                           ((TRDC_Type *)AUDIO__TRDC_BASE_NS)
  /** Peripheral COMM__TRDC base address */
  #define COMM__TRDC_BASE                          (0x5A040000u)
  /** Peripheral COMM__TRDC base address */
  #define COMM__TRDC_BASE_NS                       (0x4A040000u)
  /** Peripheral COMM__TRDC base pointer */
  #define COMM__TRDC                               ((TRDC_Type *)COMM__TRDC_BASE)
  /** Peripheral COMM__TRDC base pointer */
  #define COMM__TRDC_NS                            ((TRDC_Type *)COMM__TRDC_BASE_NS)
  /** Peripheral MAIN__TRDC base address */
  #define MAIN__TRDC_BASE                          (0x50040000u)
  /** Peripheral MAIN__TRDC base address */
  #define MAIN__TRDC_BASE_NS                       (0x40040000u)
  /** Peripheral MAIN__TRDC base pointer */
  #define MAIN__TRDC                               ((TRDC_Type *)MAIN__TRDC_BASE)
  /** Peripheral MAIN__TRDC base pointer */
  #define MAIN__TRDC_NS                            ((TRDC_Type *)MAIN__TRDC_BASE_NS)
  /** Peripheral MEDIA__TRDC base address */
  #define MEDIA__TRDC_BASE                         (0x5C040000u)
  /** Peripheral MEDIA__TRDC base address */
  #define MEDIA__TRDC_BASE_NS                      (0x4C040000u)
  /** Peripheral MEDIA__TRDC base pointer */
  #define MEDIA__TRDC                              ((TRDC_Type *)MEDIA__TRDC_BASE)
  /** Peripheral MEDIA__TRDC base pointer */
  #define MEDIA__TRDC_NS                           ((TRDC_Type *)MEDIA__TRDC_BASE_NS)
  /** Peripheral WAKE__TRDC base address */
  #define WAKE__TRDC_BASE                          (0x56040000u)
  /** Peripheral WAKE__TRDC base address */
  #define WAKE__TRDC_BASE_NS                       (0x46040000u)
  /** Peripheral WAKE__TRDC base pointer */
  #define WAKE__TRDC                               ((TRDC_Type *)WAKE__TRDC_BASE)
  /** Peripheral WAKE__TRDC base pointer */
  #define WAKE__TRDC_NS                            ((TRDC_Type *)WAKE__TRDC_BASE_NS)
  /** Array initializer of TRDC peripheral base addresses */
  #define TRDC_BASE_ADDRS                          { AUDIO__TRDC_BASE, COMM__TRDC_BASE, MAIN__TRDC_BASE, MEDIA__TRDC_BASE, WAKE__TRDC_BASE }
  /** Array initializer of TRDC peripheral base pointers */
  #define TRDC_BASE_PTRS                           { AUDIO__TRDC, COMM__TRDC, MAIN__TRDC, MEDIA__TRDC, WAKE__TRDC }
  /** Array initializer of TRDC peripheral base addresses */
  #define TRDC_BASE_ADDRS_NS                       { AUDIO__TRDC_BASE_NS, COMM__TRDC_BASE_NS, MAIN__TRDC_BASE_NS, MEDIA__TRDC_BASE_NS, WAKE__TRDC_BASE_NS }
  /** Array initializer of TRDC peripheral base pointers */
  #define TRDC_BASE_PTRS_NS                        { AUDIO__TRDC_NS, COMM__TRDC_NS, MAIN__TRDC_NS, MEDIA__TRDC_NS, WAKE__TRDC_NS }
#else
  /** Peripheral AUDIO__TRDC base address */
  #define AUDIO__TRDC_BASE                         (0x48040000u)
  /** Peripheral AUDIO__TRDC base pointer */
  #define AUDIO__TRDC                              ((TRDC_Type *)AUDIO__TRDC_BASE)
  /** Peripheral COMM__TRDC base address */
  #define COMM__TRDC_BASE                          (0x4A040000u)
  /** Peripheral COMM__TRDC base pointer */
  #define COMM__TRDC                               ((TRDC_Type *)COMM__TRDC_BASE)
  /** Peripheral MAIN__TRDC base address */
  #define MAIN__TRDC_BASE                          (0x40040000u)
  /** Peripheral MAIN__TRDC base pointer */
  #define MAIN__TRDC                               ((TRDC_Type *)MAIN__TRDC_BASE)
  /** Peripheral MEDIA__TRDC base address */
  #define MEDIA__TRDC_BASE                         (0x4C040000u)
  /** Peripheral MEDIA__TRDC base pointer */
  #define MEDIA__TRDC                              ((TRDC_Type *)MEDIA__TRDC_BASE)
  /** Peripheral WAKE__TRDC base address */
  #define WAKE__TRDC_BASE                          (0x46040000u)
  /** Peripheral WAKE__TRDC base pointer */
  #define WAKE__TRDC                               ((TRDC_Type *)WAKE__TRDC_BASE)
  /** Array initializer of TRDC peripheral base addresses */
  #define TRDC_BASE_ADDRS                          { AUDIO__TRDC_BASE, COMM__TRDC_BASE, MAIN__TRDC_BASE, MEDIA__TRDC_BASE, WAKE__TRDC_BASE }
  /** Array initializer of TRDC peripheral base pointers */
  #define TRDC_BASE_PTRS                           { AUDIO__TRDC, COMM__TRDC, MAIN__TRDC, MEDIA__TRDC, WAKE__TRDC }
#endif
/** Interrupt vectors for the TRDC peripheral type */
#define TRDC_IRQS                                { AUDIO_TRDC_IRQn, COMM_TRDC_IRQn, MAIN_TRDC_IRQn, MEDIA_TRDC_IRQn, WAKE_TRDC_IRQn }

/* TRDC_CMPT - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CMPT__TRDC base address */
  #define CMPT__TRDC_BASE                          (0x54040000u)
  /** Peripheral CMPT__TRDC base address */
  #define CMPT__TRDC_BASE_NS                       (0x44040000u)
  /** Peripheral CMPT__TRDC base pointer */
  #define CMPT__TRDC                               ((TRDC_CMPT_Type *)CMPT__TRDC_BASE)
  /** Peripheral CMPT__TRDC base pointer */
  #define CMPT__TRDC_NS                            ((TRDC_CMPT_Type *)CMPT__TRDC_BASE_NS)
  /** Array initializer of TRDC_CMPT peripheral base addresses */
  #define TRDC_CMPT_BASE_ADDRS                     { CMPT__TRDC_BASE }
  /** Array initializer of TRDC_CMPT peripheral base pointers */
  #define TRDC_CMPT_BASE_PTRS                      { CMPT__TRDC }
  /** Array initializer of TRDC_CMPT peripheral base addresses */
  #define TRDC_CMPT_BASE_ADDRS_NS                  { CMPT__TRDC_BASE_NS }
  /** Array initializer of TRDC_CMPT peripheral base pointers */
  #define TRDC_CMPT_BASE_PTRS_NS                   { CMPT__TRDC_NS }
#else
  /** Peripheral CMPT__TRDC base address */
  #define CMPT__TRDC_BASE                          (0x44040000u)
  /** Peripheral CMPT__TRDC base pointer */
  #define CMPT__TRDC                               ((TRDC_CMPT_Type *)CMPT__TRDC_BASE)
  /** Array initializer of TRDC_CMPT peripheral base addresses */
  #define TRDC_CMPT_BASE_ADDRS                     { CMPT__TRDC_BASE }
  /** Array initializer of TRDC_CMPT peripheral base pointers */
  #define TRDC_CMPT_BASE_PTRS                      { CMPT__TRDC }
#endif

